frostfire45/Codewarrior/Lib/hc12c/include/mc9s12xeq384.h
} ECT_TC0HSTR;
extern volatile ECT_TC0HSTR _ECT_TC0H @(REG_BASE + 0x00000078UL);
#define ECT_TC0H                        _ECT_TC0H.Word


/*** ECT_TC1H - Timer Input Capture Holding Registers 1; 0x0000007A ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** ECT_TC1Hhi - Timer Input Capture Holding Registers 1 High; 0x0000007A ***/
    union {
      byte Byte;
    } ECT_TC1HhiSTR;
    #define ECT_TC1Hhi                  _ECT_TC1H.Overlap_STR.ECT_TC1HhiSTR.Byte
    

    /*** ECT_TC1Hlo - Timer Input Capture Holding Registers 1 Low; 0x0000007B ***/
    union {
      byte Byte;
    } ECT_TC1HloSTR;
    #define ECT_TC1Hlo                  _ECT_TC1H.Overlap_STR.ECT_TC1HloSTR.Byte
    
  } Overlap_STR;

} ECT_TC1HSTR;
extern volatile ECT_TC1HSTR _ECT_TC1H @(REG_BASE + 0x0000007AUL);
#define ECT_TC1H                        _ECT_TC1H.Word


/*** ECT_TC2H - Timer Input Capture Holding Registers 2; 0x0000007C ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** ECT_TC2Hhi - Timer Input Capture Holding Registers 2 High; 0x0000007C ***/
    union {
      byte Byte;
    } ECT_TC2HhiSTR;
    #define ECT_TC2Hhi                  _ECT_TC2H.Overlap_STR.ECT_TC2HhiSTR.Byte
    

    /*** ECT_TC2Hlo - Timer Input Capture Holding Registers 2 Low; 0x0000007D ***/
    union {
      byte Byte;
    } ECT_TC2HloSTR;
    #define ECT_TC2Hlo                  _ECT_TC2H.Overlap_STR.ECT_TC2HloSTR.Byte
    
  } Overlap_STR;

} ECT_TC2HSTR;
extern volatile ECT_TC2HSTR _ECT_TC2H @(REG_BASE + 0x0000007CUL);
#define ECT_TC2H                        _ECT_TC2H.Word


/*** ECT_TC3H - Timer Input Capture Holding Registers 3; 0x0000007E ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** ECT_TC3Hhi - Timer Input Capture Holding Registers 3 High; 0x0000007E ***/
    union {
      byte Byte;
    } ECT_TC3HhiSTR;
    #define ECT_TC3Hhi                  _ECT_TC3H.Overlap_STR.ECT_TC3HhiSTR.Byte
    

    /*** ECT_TC3Hlo - Timer Input Capture Holding Registers 3 Low; 0x0000007F ***/
    union {
      byte Byte;
    } ECT_TC3HloSTR;
    #define ECT_TC3Hlo                  _ECT_TC3H.Overlap_STR.ECT_TC3HloSTR.Byte
    
  } Overlap_STR;

} ECT_TC3HSTR;
extern volatile ECT_TC3HSTR _ECT_TC3H @(REG_BASE + 0x0000007EUL);
#define ECT_TC3H                        _ECT_TC3H.Word


/*** ATD1CTL01 - ATD 1 Control Register 01; 0x00000080 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** ATD1CTL0 - ATD 1 Control Register 0; 0x00000080 ***/
    union {
      byte Byte;
      struct {
        byte WRAP0       :1;                                       /* Wrap Around Channel Select Bit 0 */
        byte WRAP1       :1;                                       /* Wrap Around Channel Select Bit 1 */
        byte WRAP2       :1;                                       /* Wrap Around Channel Select Bit 2 */
        byte WRAP3       :1;                                       /* Wrap Around Channel Select Bit 3 */
        byte             :1; 
        byte             :1; 
        byte             :1; 
        byte             :1; 
      } Bits;
      struct {
        byte grpWRAP :4;
        byte     :1;
        byte     :1;
        byte     :1;
        byte     :1;
      } MergedBits;
    } ATD1CTL0STR;
    #define ATD1CTL0                    _ATD1CTL01.Overlap_STR.ATD1CTL0STR.Byte
    #define ATD1CTL0_WRAP0              _ATD1CTL01.Overlap_STR.ATD1CTL0STR.Bits.WRAP0
    #define ATD1CTL0_WRAP1              _ATD1CTL01.Overlap_STR.ATD1CTL0STR.Bits.WRAP1
    #define ATD1CTL0_WRAP2              _ATD1CTL01.Overlap_STR.ATD1CTL0STR.Bits.WRAP2
    #define ATD1CTL0_WRAP3              _ATD1CTL01.Overlap_STR.ATD1CTL0STR.Bits.WRAP3
    /* ATD1CTL_ARR: Access 6 ATD1CTLx registers in an array */
    #define ATD1CTL_ARR                 ((volatile byte *) &ATD1CTL0)
    #define ATD1CTL0_WRAP               _ATD1CTL01.Overlap_STR.ATD1CTL0STR.MergedBits.grpWRAP
    
    #define ATD1CTL0_WRAP0_MASK         1U
    #define ATD1CTL0_WRAP1_MASK         2U
    #define ATD1CTL0_WRAP2_MASK         4U
    #define ATD1CTL0_WRAP3_MASK         8U
    #define ATD1CTL0_WRAP_MASK          15U
    #define ATD1CTL0_WRAP_BITNUM        0U
    

    /*** ATD1CTL1 - ATD 1 Control Register 1; 0x00000081 ***/
    union {
      byte Byte;
      struct {
        byte ETRIGCH0    :1;                                       /* External Trigger Channel Select Bit 0 */
        byte ETRIGCH1    :1;                                       /* External Trigger Channel Select Bit 1 */
        byte ETRIGCH2    :1;                                       /* External Trigger Channel Select Bit 2 */
        byte ETRIGCH3    :1;                                       /* External Trigger Channel Select Bit 3 */
        byte SMP_DIS     :1;                                       /* Discharge Before Sampling Bit */
        byte SRES0       :1;                                       /* A/D Resolution Select Bit 0 */
        byte SRES1       :1;                                       /* A/D Resolution Select Bit 1 */
        byte ETRIGSEL    :1;                                       /* External Trigger Source Select */
      } Bits;
      struct {
        byte grpETRIGCH :4;
        byte     :1;
        byte grpSRES :2;
        byte     :1;
      } MergedBits;
    } ATD1CTL1STR;
    #define ATD1CTL1                    _ATD1CTL01.Overlap_STR.ATD1CTL1STR.Byte
    #define ATD1CTL1_ETRIGCH0           _ATD1CTL01.Overlap_STR.ATD1CTL1STR.Bits.ETRIGCH0
    #define ATD1CTL1_ETRIGCH1           _ATD1CTL01.Overlap_STR.ATD1CTL1STR.Bits.ETRIGCH1
    #define ATD1CTL1_ETRIGCH2           _ATD1CTL01.Overlap_STR.ATD1CTL1STR.Bits.ETRIGCH2
    #define ATD1CTL1_ETRIGCH3           _ATD1CTL01.Overlap_STR.ATD1CTL1STR.Bits.ETRIGCH3
    #define ATD1CTL1_SMP_DIS            _ATD1CTL01.Overlap_STR.ATD1CTL1STR.Bits.SMP_DIS
    #define ATD1CTL1_SRES0              _ATD1CTL01.Overlap_STR.ATD1CTL1STR.Bits.SRES0
    #define ATD1CTL1_SRES1              _ATD1CTL01.Overlap_STR.ATD1CTL1STR.Bits.SRES1
    #define ATD1CTL1_ETRIGSEL           _ATD1CTL01.Overlap_STR.ATD1CTL1STR.Bits.ETRIGSEL
    #define ATD1CTL1_ETRIGCH            _ATD1CTL01.Overlap_STR.ATD1CTL1STR.MergedBits.grpETRIGCH
    #define ATD1CTL1_SRES               _ATD1CTL01.Overlap_STR.ATD1CTL1STR.MergedBits.grpSRES
    
    #define ATD1CTL1_ETRIGCH0_MASK      1U
    #define ATD1CTL1_ETRIGCH1_MASK      2U
    #define ATD1CTL1_ETRIGCH2_MASK      4U
    #define ATD1CTL1_ETRIGCH3_MASK      8U
    #define ATD1CTL1_SMP_DIS_MASK       16U
    #define ATD1CTL1_SRES0_MASK         32U
    #define ATD1CTL1_SRES1_MASK         64U
    #define ATD1CTL1_ETRIGSEL_MASK      128U
    #define ATD1CTL1_ETRIGCH_MASK       15U
    #define ATD1CTL1_ETRIGCH_BITNUM     0U
    #define ATD1CTL1_SRES_MASK          96U
    #define ATD1CTL1_SRES_BITNUM        5U
    
  } Overlap_STR;

