frostfire45/Codewarrior/Lib/hc12c/include/mc9s12xeq384.h
    #define ATD1DR15L_BIT0_MASK         1U
    #define ATD1DR15L_BIT1_MASK         2U
    #define ATD1DR15L_BIT2_MASK         4U
    #define ATD1DR15L_BIT3_MASK         8U
    #define ATD1DR15L_BIT4_MASK         16U
    #define ATD1DR15L_BIT5_MASK         32U
    #define ATD1DR15L_BIT6_MASK         64U
    #define ATD1DR15L_BIT7_MASK         128U
    
  } Overlap_STR;

  struct {
    word BIT0        :1;                                       /* Bit 0 */
    word BIT1        :1;                                       /* Bit 1 */
    word BIT2        :1;                                       /* Bit 2 */
    word BIT3        :1;                                       /* Bit 3 */
    word BIT4        :1;                                       /* Bit 4 */
    word BIT5        :1;                                       /* Bit 5 */
    word BIT6        :1;                                       /* Bit 6 */
    word BIT7        :1;                                       /* Bit 7 */
    word BIT8        :1;                                       /* Bit 8 */
    word BIT9        :1;                                       /* Bit 9 */
    word BIT10       :1;                                       /* Bit 10 */
    word BIT11       :1;                                       /* Bit 11 */
    word BIT12       :1;                                       /* Bit 12 */
    word BIT13       :1;                                       /* Bit 13 */
    word BIT14       :1;                                       /* Bit 14 */
    word BIT15       :1;                                       /* Bit 15 */
  } Bits;
} ATD1DR15STR;
extern volatile ATD1DR15STR _ATD1DR15 @(REG_BASE + 0x000000AEUL);
#define ATD1DR15                        _ATD1DR15.Word
#define ATD1DR15_BIT0                   _ATD1DR15.Bits.BIT0
#define ATD1DR15_BIT1                   _ATD1DR15.Bits.BIT1
#define ATD1DR15_BIT2                   _ATD1DR15.Bits.BIT2
#define ATD1DR15_BIT3                   _ATD1DR15.Bits.BIT3
#define ATD1DR15_BIT4                   _ATD1DR15.Bits.BIT4
#define ATD1DR15_BIT5                   _ATD1DR15.Bits.BIT5
#define ATD1DR15_BIT6                   _ATD1DR15.Bits.BIT6
#define ATD1DR15_BIT7                   _ATD1DR15.Bits.BIT7
#define ATD1DR15_BIT8                   _ATD1DR15.Bits.BIT8
#define ATD1DR15_BIT9                   _ATD1DR15.Bits.BIT9
#define ATD1DR15_BIT10                  _ATD1DR15.Bits.BIT10
#define ATD1DR15_BIT11                  _ATD1DR15.Bits.BIT11
#define ATD1DR15_BIT12                  _ATD1DR15.Bits.BIT12
#define ATD1DR15_BIT13                  _ATD1DR15.Bits.BIT13
#define ATD1DR15_BIT14                  _ATD1DR15.Bits.BIT14
#define ATD1DR15_BIT15                  _ATD1DR15.Bits.BIT15

#define ATD1DR15_BIT0_MASK              1U
#define ATD1DR15_BIT1_MASK              2U
#define ATD1DR15_BIT2_MASK              4U
#define ATD1DR15_BIT3_MASK              8U
#define ATD1DR15_BIT4_MASK              16U
#define ATD1DR15_BIT5_MASK              32U
#define ATD1DR15_BIT6_MASK              64U
#define ATD1DR15_BIT7_MASK              128U
#define ATD1DR15_BIT8_MASK              256U
#define ATD1DR15_BIT9_MASK              512U
#define ATD1DR15_BIT10_MASK             1024U
#define ATD1DR15_BIT11_MASK             2048U
#define ATD1DR15_BIT12_MASK             4096U
#define ATD1DR15_BIT13_MASK             8192U
#define ATD1DR15_BIT14_MASK             16384U
#define ATD1DR15_BIT15_MASK             32768U


/*** IIC1_IBAD - IIC Address Register; 0x000000B0 ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte ADR1        :1;                                       /* Slave Address Bit 1 */
    byte ADR2        :1;                                       /* Slave Address Bit 2 */
    byte ADR3        :1;                                       /* Slave Address Bit 3 */
    byte ADR4        :1;                                       /* Slave Address Bit 4 */
    byte ADR5        :1;                                       /* Slave Address Bit 5 */
    byte ADR6        :1;                                       /* Slave Address Bit 6 */
    byte ADR7        :1;                                       /* Slave Address Bit 7 */
  } Bits;
  struct {
    byte         :1;
    byte grpADR_1 :7;
  } MergedBits;
} IIC1_IBADSTR;
extern volatile IIC1_IBADSTR _IIC1_IBAD @(REG_BASE + 0x000000B0UL);
#define IIC1_IBAD                       _IIC1_IBAD.Byte
#define IIC1_IBAD_ADR1                  _IIC1_IBAD.Bits.ADR1
#define IIC1_IBAD_ADR2                  _IIC1_IBAD.Bits.ADR2
#define IIC1_IBAD_ADR3                  _IIC1_IBAD.Bits.ADR3
#define IIC1_IBAD_ADR4                  _IIC1_IBAD.Bits.ADR4
#define IIC1_IBAD_ADR5                  _IIC1_IBAD.Bits.ADR5
#define IIC1_IBAD_ADR6                  _IIC1_IBAD.Bits.ADR6
#define IIC1_IBAD_ADR7                  _IIC1_IBAD.Bits.ADR7
#define IIC1_IBAD_ADR_1                 _IIC1_IBAD.MergedBits.grpADR_1
#define IIC1_IBAD_ADR                   IIC1_IBAD_ADR_1

#define IIC1_IBAD_ADR1_MASK             2U
#define IIC1_IBAD_ADR2_MASK             4U
#define IIC1_IBAD_ADR3_MASK             8U
#define IIC1_IBAD_ADR4_MASK             16U
#define IIC1_IBAD_ADR5_MASK             32U
#define IIC1_IBAD_ADR6_MASK             64U
#define IIC1_IBAD_ADR7_MASK             128U
#define IIC1_IBAD_ADR_1_MASK            254U
#define IIC1_IBAD_ADR_1_BITNUM          1U


/*** IIC1_IBFD - IIC Frequency Divider Register; 0x000000B1 ***/
typedef union {
  byte Byte;
  struct {
    byte IBC0        :1;                                       /* I-Bus Clock Rate 0 */
    byte IBC1        :1;                                       /* I-Bus Clock Rate 1 */
    byte IBC2        :1;                                       /* I-Bus Clock Rate 2 */
    byte IBC3        :1;                                       /* I-Bus Clock Rate 3 */
    byte IBC4        :1;                                       /* I-Bus Clock Rate 4 */
    byte IBC5        :1;                                       /* I-Bus Clock Rate 5 */
    byte IBC6        :1;                                       /* I-Bus Clock Rate 6 */
    byte IBC7        :1;                                       /* I-Bus Clock Rate 7 */
  } Bits;
} IIC1_IBFDSTR;
extern volatile IIC1_IBFDSTR _IIC1_IBFD @(REG_BASE + 0x000000B1UL);
#define IIC1_IBFD                       _IIC1_IBFD.Byte
#define IIC1_IBFD_IBC0                  _IIC1_IBFD.Bits.IBC0
#define IIC1_IBFD_IBC1                  _IIC1_IBFD.Bits.IBC1
#define IIC1_IBFD_IBC2                  _IIC1_IBFD.Bits.IBC2
#define IIC1_IBFD_IBC3                  _IIC1_IBFD.Bits.IBC3
#define IIC1_IBFD_IBC4                  _IIC1_IBFD.Bits.IBC4
#define IIC1_IBFD_IBC5                  _IIC1_IBFD.Bits.IBC5
#define IIC1_IBFD_IBC6                  _IIC1_IBFD.Bits.IBC6
#define IIC1_IBFD_IBC7                  _IIC1_IBFD.Bits.IBC7

#define IIC1_IBFD_IBC0_MASK             1U
#define IIC1_IBFD_IBC1_MASK             2U
#define IIC1_IBFD_IBC2_MASK             4U
#define IIC1_IBFD_IBC3_MASK             8U
#define IIC1_IBFD_IBC4_MASK             16U
#define IIC1_IBFD_IBC5_MASK             32U
#define IIC1_IBFD_IBC6_MASK             64U
#define IIC1_IBFD_IBC7_MASK             128U


