frostfire45/Codewarrior/Lib/hc12c/include/mc9s12xeq384.h
/*** IIC1_IBCR - IIC Control Register; 0x000000B2 ***/
typedef union {
  byte Byte;
  struct {
    byte IBSWAI      :1;                                       /* I-Bus Interface Stop in WAIT mode */
    byte             :1; 
    byte RSTA        :1;                                       /* Repeat Start */
    byte TXAK        :1;                                       /* Transmit Acknowledge enable */
    byte TX_RX       :1;                                       /* Transmit/Receive mode select bit */
    byte MS_SL       :1;                                       /* Master/Slave mode select bit */
    byte IBIE        :1;                                       /* I-Bus Interrupt Enable */
    byte IBEN        :1;                                       /* I-Bus Enable */
  } Bits;
} IIC1_IBCRSTR;
extern volatile IIC1_IBCRSTR _IIC1_IBCR @(REG_BASE + 0x000000B2UL);
#define IIC1_IBCR                       _IIC1_IBCR.Byte
#define IIC1_IBCR_IBSWAI                _IIC1_IBCR.Bits.IBSWAI
#define IIC1_IBCR_RSTA                  _IIC1_IBCR.Bits.RSTA
#define IIC1_IBCR_TXAK                  _IIC1_IBCR.Bits.TXAK
#define IIC1_IBCR_TX_RX                 _IIC1_IBCR.Bits.TX_RX
#define IIC1_IBCR_MS_SL                 _IIC1_IBCR.Bits.MS_SL
#define IIC1_IBCR_IBIE                  _IIC1_IBCR.Bits.IBIE
#define IIC1_IBCR_IBEN                  _IIC1_IBCR.Bits.IBEN

#define IIC1_IBCR_IBSWAI_MASK           1U
#define IIC1_IBCR_RSTA_MASK             4U
#define IIC1_IBCR_TXAK_MASK             8U
#define IIC1_IBCR_TX_RX_MASK            16U
#define IIC1_IBCR_MS_SL_MASK            32U
#define IIC1_IBCR_IBIE_MASK             64U
#define IIC1_IBCR_IBEN_MASK             128U


/*** IIC1_IBSR - IIC Status Register; 0x000000B3 ***/
typedef union {
  byte Byte;
  struct {
    byte RXAK        :1;                                       /* Received Acknowledge */
    byte IBIF        :1;                                       /* I-Bus Interrupt */
    byte SRW         :1;                                       /* Slave Read/Write */
    byte             :1; 
    byte IBAL        :1;                                       /* Arbitration Lost */
    byte IBB         :1;                                       /* Bus busy bit */
    byte IAAS        :1;                                       /* Addressed as a slave bit */
    byte TCF         :1;                                       /* Data transferring bit */
  } Bits;
} IIC1_IBSRSTR;
extern volatile IIC1_IBSRSTR _IIC1_IBSR @(REG_BASE + 0x000000B3UL);
#define IIC1_IBSR                       _IIC1_IBSR.Byte
#define IIC1_IBSR_RXAK                  _IIC1_IBSR.Bits.RXAK
#define IIC1_IBSR_IBIF                  _IIC1_IBSR.Bits.IBIF
#define IIC1_IBSR_SRW                   _IIC1_IBSR.Bits.SRW
#define IIC1_IBSR_IBAL                  _IIC1_IBSR.Bits.IBAL
#define IIC1_IBSR_IBB                   _IIC1_IBSR.Bits.IBB
#define IIC1_IBSR_IAAS                  _IIC1_IBSR.Bits.IAAS
#define IIC1_IBSR_TCF                   _IIC1_IBSR.Bits.TCF

#define IIC1_IBSR_RXAK_MASK             1U
#define IIC1_IBSR_IBIF_MASK             2U
#define IIC1_IBSR_SRW_MASK              4U
#define IIC1_IBSR_IBAL_MASK             16U
#define IIC1_IBSR_IBB_MASK              32U
#define IIC1_IBSR_IAAS_MASK             64U
#define IIC1_IBSR_TCF_MASK              128U


/*** IIC1_IBDR - IIC Data I/O Register; 0x000000B4 ***/
typedef union {
  byte Byte;
  struct {
    byte D0          :1;                                       /* IIC Data Bit 0 */
    byte D1          :1;                                       /* IIC Data Bit 1 */
    byte D2          :1;                                       /* IIC Data Bit 2 */
    byte D3          :1;                                       /* IIC Data Bit 3 */
    byte D4          :1;                                       /* IIC Data Bit 4 */
    byte D5          :1;                                       /* IIC Data Bit 5 */
    byte D6          :1;                                       /* IIC Data Bit 6 */
    byte D7          :1;                                       /* IIC Data Bit 7 */
  } Bits;
} IIC1_IBDRSTR;
extern volatile IIC1_IBDRSTR _IIC1_IBDR @(REG_BASE + 0x000000B4UL);
#define IIC1_IBDR                       _IIC1_IBDR.Byte
#define IIC1_IBDR_D0                    _IIC1_IBDR.Bits.D0
#define IIC1_IBDR_D1                    _IIC1_IBDR.Bits.D1
#define IIC1_IBDR_D2                    _IIC1_IBDR.Bits.D2
#define IIC1_IBDR_D3                    _IIC1_IBDR.Bits.D3
#define IIC1_IBDR_D4                    _IIC1_IBDR.Bits.D4
#define IIC1_IBDR_D5                    _IIC1_IBDR.Bits.D5
#define IIC1_IBDR_D6                    _IIC1_IBDR.Bits.D6
#define IIC1_IBDR_D7                    _IIC1_IBDR.Bits.D7

#define IIC1_IBDR_D0_MASK               1U
#define IIC1_IBDR_D1_MASK               2U
#define IIC1_IBDR_D2_MASK               4U
#define IIC1_IBDR_D3_MASK               8U
#define IIC1_IBDR_D4_MASK               16U
#define IIC1_IBDR_D5_MASK               32U
#define IIC1_IBDR_D6_MASK               64U
#define IIC1_IBDR_D7_MASK               128U


/*** IIC1_IBCR2 - IIC Control Register 2; 0x000000B5 ***/
typedef union {
  byte Byte;
  struct {
    byte ADR8        :1;                                       /* Slave Address Bit 8 */
    byte ADR9        :1;                                       /* Slave Address Bit 9 */
    byte ADR10       :1;                                       /* Slave Address Bit 10 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte ADTYPE      :1;                                       /* Address Type */
    byte GCEN        :1;                                       /* General Call Enable */
  } Bits;
  struct {
    byte grpADR_8 :3;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} IIC1_IBCR2STR;
extern volatile IIC1_IBCR2STR _IIC1_IBCR2 @(REG_BASE + 0x000000B5UL);
#define IIC1_IBCR2                      _IIC1_IBCR2.Byte
#define IIC1_IBCR2_ADR8                 _IIC1_IBCR2.Bits.ADR8
#define IIC1_IBCR2_ADR9                 _IIC1_IBCR2.Bits.ADR9
#define IIC1_IBCR2_ADR10                _IIC1_IBCR2.Bits.ADR10
#define IIC1_IBCR2_ADTYPE               _IIC1_IBCR2.Bits.ADTYPE
#define IIC1_IBCR2_GCEN                 _IIC1_IBCR2.Bits.GCEN
#define IIC1_IBCR2_ADR_8                _IIC1_IBCR2.MergedBits.grpADR_8
#define IIC1_IBCR2_ADR                  IIC1_IBCR2_ADR_8

