frostfire45/Codewarrior/Lib/hc12c/include/mc9s12xeq384.h
    #define SCI3ACR2_BKDFE_MASK         1U
    #define SCI3ACR2_BERRM0_MASK        2U
    #define SCI3ACR2_BERRM1_MASK        4U
    #define SCI3ACR2_BERRM_MASK         6U
    #define SCI3ACR2_BERRM_BITNUM       1U
    
    /*** SCI3CR1 - SCI 3 Control Register 1; Several registers at the same address ***/
    union {
      struct {
        byte PT          :1;                                       /* Parity Type Bit */
        byte PE          :1;                                       /* Parity Enable Bit */
        byte ILT         :1;                                       /* Idle Line Type Bit */
        byte WAKE        :1;                                       /* Wakeup Condition Bit */
        byte M           :1;                                       /* Data Format Mode Bit */
        byte RSRC        :1;                                       /* Receiver Source Bit */
        byte SCISWAI     :1;                                       /* SCI Stop in Wait Mode Bit */
        byte LOOPS       :1;                                       /* Loop Select Bit */
      } Bits;
    } SCI3CR1STR;
    #define SCI3CR1                     _SCI3ACR2.Byte
    #define SCI3CR1_PT                  _SCI3ACR2.SameAddr_STR.SCI3CR1STR.Bits.PT
    #define SCI3CR1_PE                  _SCI3ACR2.SameAddr_STR.SCI3CR1STR.Bits.PE
    #define SCI3CR1_ILT                 _SCI3ACR2.SameAddr_STR.SCI3CR1STR.Bits.ILT
    #define SCI3CR1_WAKE                _SCI3ACR2.SameAddr_STR.SCI3CR1STR.Bits.WAKE
    #define SCI3CR1_M                   _SCI3ACR2.SameAddr_STR.SCI3CR1STR.Bits.M
    #define SCI3CR1_RSRC                _SCI3ACR2.SameAddr_STR.SCI3CR1STR.Bits.RSRC
    #define SCI3CR1_SCISWAI             _SCI3ACR2.SameAddr_STR.SCI3CR1STR.Bits.SCISWAI
    #define SCI3CR1_LOOPS               _SCI3ACR2.SameAddr_STR.SCI3CR1STR.Bits.LOOPS
    
    #define SCI3CR1_PT_MASK             1U
    #define SCI3CR1_PE_MASK             2U
    #define SCI3CR1_ILT_MASK            4U
    #define SCI3CR1_WAKE_MASK           8U
    #define SCI3CR1_M_MASK              16U
    #define SCI3CR1_RSRC_MASK           32U
    #define SCI3CR1_SCISWAI_MASK        64U
    #define SCI3CR1_LOOPS_MASK          128U
    
  } SameAddr_STR; /*Several registers at the same address */

} SCI3ACR2STR;
extern volatile SCI3ACR2STR _SCI3ACR2 @(REG_BASE + 0x000000C2UL);


/*** SCI3CR2 - SCI 3 Control Register 2; 0x000000C3 ***/
typedef union {
  byte Byte;
  struct {
    byte SBK         :1;                                       /* Send Break Bit */
    byte RWU         :1;                                       /* Receiver Wakeup Bit */
    byte RE          :1;                                       /* Receiver Enable Bit */
    byte TE          :1;                                       /* Transmitter Enable Bit */
    byte ILIE        :1;                                       /* Idle Line Interrupt Enable Bit */
    byte RIE         :1;                                       /* Receiver Full Interrupt Enable Bit */
    byte TCIE        :1;                                       /* Transmission Complete Interrupt Enable Bit */
    byte TIE         :1;                                       /* Transmitter Interrupt Enable Bit */
  } Bits;
} SCI3CR2STR;
extern volatile SCI3CR2STR _SCI3CR2 @(REG_BASE + 0x000000C3UL);
#define SCI3CR2                         _SCI3CR2.Byte
#define SCI3CR2_SBK                     _SCI3CR2.Bits.SBK
#define SCI3CR2_RWU                     _SCI3CR2.Bits.RWU
#define SCI3CR2_RE                      _SCI3CR2.Bits.RE
#define SCI3CR2_TE                      _SCI3CR2.Bits.TE
#define SCI3CR2_ILIE                    _SCI3CR2.Bits.ILIE
#define SCI3CR2_RIE                     _SCI3CR2.Bits.RIE
#define SCI3CR2_TCIE                    _SCI3CR2.Bits.TCIE
#define SCI3CR2_TIE                     _SCI3CR2.Bits.TIE

#define SCI3CR2_SBK_MASK                1U
#define SCI3CR2_RWU_MASK                2U
#define SCI3CR2_RE_MASK                 4U
#define SCI3CR2_TE_MASK                 8U
#define SCI3CR2_ILIE_MASK               16U
#define SCI3CR2_RIE_MASK                32U
#define SCI3CR2_TCIE_MASK               64U
#define SCI3CR2_TIE_MASK                128U


/*** SCI3SR1 - SCI 3 Status Register 1; 0x000000C4 ***/
typedef union {
  byte Byte;
  struct {
    byte PF          :1;                                       /* Parity Error Flag */
    byte FE          :1;                                       /* Framing Error Flag */
    byte NF          :1;                                       /* Noise Flag */
    byte OR          :1;                                       /* Overrun Flag */
    byte IDLE        :1;                                       /* Idle Line Flag */
    byte RDRF_bit    :1;                                       /* Receive Data Register Full Flag */ /*Warning: bit name is duplicated with register name*/
    byte TC          :1;                                       /* Transmit Complete Flag */
    byte TDRE        :1;                                       /* Transmit Data Register Empty Flag */
  } Bits;
} SCI3SR1STR;
extern volatile SCI3SR1STR _SCI3SR1 @(REG_BASE + 0x000000C4UL);
#define SCI3SR1                         _SCI3SR1.Byte
#define SCI3SR1_PF                      _SCI3SR1.Bits.PF
#define SCI3SR1_FE                      _SCI3SR1.Bits.FE
#define SCI3SR1_NF                      _SCI3SR1.Bits.NF
#define SCI3SR1_OR                      _SCI3SR1.Bits.OR
#define SCI3SR1_IDLE                    _SCI3SR1.Bits.IDLE
#define SCI3SR1_RDRF                    _SCI3SR1.Bits.RDRF_bit
#define SCI3SR1_TC                      _SCI3SR1.Bits.TC
#define SCI3SR1_TDRE                    _SCI3SR1.Bits.TDRE

#define SCI3SR1_PF_MASK                 1U
#define SCI3SR1_FE_MASK                 2U
#define SCI3SR1_NF_MASK                 4U
#define SCI3SR1_OR_MASK                 8U
#define SCI3SR1_IDLE_MASK               16U
#define SCI3SR1_RDRF_MASK               32U
#define SCI3SR1_TC_MASK                 64U
#define SCI3SR1_TDRE_MASK               128U


/*** SCI3SR2 - SCI 3 Status Register 2; 0x000000C5 ***/
typedef union {
  byte Byte;
  struct {
    byte RAF         :1;                                       /* Receiver Active Flag */
    byte TXDIR       :1;                                       /* Transmitter pin data direction in Single-Wire mode */
    byte BRK13       :1;                                       /* Break Transmit character length */
    byte RXPOL       :1;                                       /* Receive Polarity */
    byte TXPOL       :1;                                       /* Transmit Polarity */
    byte             :1; 
    byte             :1; 
    byte AMAP        :1;                                       /* Alternative Map */
  } Bits;
} SCI3SR2STR;
extern volatile SCI3SR2STR _SCI3SR2 @(REG_BASE + 0x000000C5UL);
#define SCI3SR2                         _SCI3SR2.Byte
#define SCI3SR2_RAF                     _SCI3SR2.Bits.RAF
#define SCI3SR2_TXDIR                   _SCI3SR2.Bits.TXDIR
#define SCI3SR2_BRK13                   _SCI3SR2.Bits.BRK13
#define SCI3SR2_RXPOL                   _SCI3SR2.Bits.RXPOL
#define SCI3SR2_TXPOL                   _SCI3SR2.Bits.TXPOL
#define SCI3SR2_AMAP                    _SCI3SR2.Bits.AMAP

