frostfire45/Codewarrior/Lib/hc12c/include/mc9s12xeq384.h
#define MPUDESC1_LOW_ADDR11_MASK        1U
#define MPUDESC1_LOW_ADDR12_MASK        2U
#define MPUDESC1_LOW_ADDR13_MASK        4U
#define MPUDESC1_LOW_ADDR14_MASK        8U
#define MPUDESC1_LOW_ADDR15_MASK        16U
#define MPUDESC1_LOW_ADDR16_MASK        32U
#define MPUDESC1_LOW_ADDR17_MASK        64U
#define MPUDESC1_LOW_ADDR18_MASK        128U


/*** MPUDESC2 - MPU Descriptor Register 2; 0x0000011C ***/
typedef union {
  byte Byte;
  struct {
    byte LOW_ADDR3   :1;                                       /* Memory range lower boundary address bits, bit 3 */
    byte LOW_ADDR4   :1;                                       /* Memory range lower boundary address bits, bit 4 */
    byte LOW_ADDR5   :1;                                       /* Memory range lower boundary address bits, bit 5 */
    byte LOW_ADDR6   :1;                                       /* Memory range lower boundary address bits, bit 6 */
    byte LOW_ADDR7   :1;                                       /* Memory range lower boundary address bits, bit 7 */
    byte LOW_ADDR8   :1;                                       /* Memory range lower boundary address bits, bit 8 */
    byte LOW_ADDR9   :1;                                       /* Memory range lower boundary address bits, bit 9 */
    byte LOW_ADDR10  :1;                                       /* Memory range lower boundary address bits, bit 10 */
  } Bits;
} MPUDESC2STR;
extern volatile MPUDESC2STR _MPUDESC2 @(REG_BASE + 0x0000011CUL);
#define MPUDESC2                        _MPUDESC2.Byte
#define MPUDESC2_LOW_ADDR3              _MPUDESC2.Bits.LOW_ADDR3
#define MPUDESC2_LOW_ADDR4              _MPUDESC2.Bits.LOW_ADDR4
#define MPUDESC2_LOW_ADDR5              _MPUDESC2.Bits.LOW_ADDR5
#define MPUDESC2_LOW_ADDR6              _MPUDESC2.Bits.LOW_ADDR6
#define MPUDESC2_LOW_ADDR7              _MPUDESC2.Bits.LOW_ADDR7
#define MPUDESC2_LOW_ADDR8              _MPUDESC2.Bits.LOW_ADDR8
#define MPUDESC2_LOW_ADDR9              _MPUDESC2.Bits.LOW_ADDR9
#define MPUDESC2_LOW_ADDR10             _MPUDESC2.Bits.LOW_ADDR10

#define MPUDESC2_LOW_ADDR3_MASK         1U
#define MPUDESC2_LOW_ADDR4_MASK         2U
#define MPUDESC2_LOW_ADDR5_MASK         4U
#define MPUDESC2_LOW_ADDR6_MASK         8U
#define MPUDESC2_LOW_ADDR7_MASK         16U
#define MPUDESC2_LOW_ADDR8_MASK         32U
#define MPUDESC2_LOW_ADDR9_MASK         64U
#define MPUDESC2_LOW_ADDR10_MASK        128U


/*** MPUDESC3 - MPU Descriptor Register 2; 0x0000011D ***/
typedef union {
  byte Byte;
  struct {
    byte HIGH_ADDR19 :1;                                       /* Memory range upper boundary address bits, bit 19 */
    byte HIGH_ADDR20 :1;                                       /* Memory range upper boundary address bits, bit 20 */
    byte HIGH_ADDR21 :1;                                       /* Memory range upper boundary address bits, bit 21 */
    byte HIGH_ADDR22 :1;                                       /* Memory range upper boundary address bits, bit 22 */
    byte             :1; 
    byte             :1; 
    byte NEX         :1;                                       /* No-Execute bit */
    byte WP          :1;                                       /* Write-Protect bit */
  } Bits;
  struct {
    byte grpHIGH_ADDR_19 :4;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} MPUDESC3STR;
extern volatile MPUDESC3STR _MPUDESC3 @(REG_BASE + 0x0000011DUL);
#define MPUDESC3                        _MPUDESC3.Byte
#define MPUDESC3_HIGH_ADDR19            _MPUDESC3.Bits.HIGH_ADDR19
#define MPUDESC3_HIGH_ADDR20            _MPUDESC3.Bits.HIGH_ADDR20
#define MPUDESC3_HIGH_ADDR21            _MPUDESC3.Bits.HIGH_ADDR21
#define MPUDESC3_HIGH_ADDR22            _MPUDESC3.Bits.HIGH_ADDR22
#define MPUDESC3_NEX                    _MPUDESC3.Bits.NEX
#define MPUDESC3_WP                     _MPUDESC3.Bits.WP
#define MPUDESC3_HIGH_ADDR_19           _MPUDESC3.MergedBits.grpHIGH_ADDR_19
#define MPUDESC3_HIGH_ADDR              MPUDESC3_HIGH_ADDR_19

#define MPUDESC3_HIGH_ADDR19_MASK       1U
#define MPUDESC3_HIGH_ADDR20_MASK       2U
#define MPUDESC3_HIGH_ADDR21_MASK       4U
#define MPUDESC3_HIGH_ADDR22_MASK       8U
#define MPUDESC3_NEX_MASK               64U
#define MPUDESC3_WP_MASK                128U
#define MPUDESC3_HIGH_ADDR_19_MASK      15U
#define MPUDESC3_HIGH_ADDR_19_BITNUM    0U


/*** MPUDESC4 - MPU Descriptor Register 2; 0x0000011E ***/
typedef union {
  byte Byte;
  struct {
    byte HIGH_ADDR11 :1;                                       /* Memory range upper boundary address bits, bit 11 */
    byte HIGH_ADDR12 :1;                                       /* Memory range upper boundary address bits, bit 12 */
    byte HIGH_ADDR13 :1;                                       /* Memory range upper boundary address bits, bit 13 */
    byte HIGH_ADDR14 :1;                                       /* Memory range upper boundary address bits, bit 14 */
    byte HIGH_ADDR15 :1;                                       /* Memory range upper boundary address bits, bit 15 */
    byte HIGH_ADDR16 :1;                                       /* Memory range upper boundary address bits, bit 16 */
    byte HIGH_ADDR17 :1;                                       /* Memory range upper boundary address bits, bit 17 */
    byte HIGH_ADDR18 :1;                                       /* Memory range upper boundary address bits, bit 18 */
  } Bits;
} MPUDESC4STR;
extern volatile MPUDESC4STR _MPUDESC4 @(REG_BASE + 0x0000011EUL);
#define MPUDESC4                        _MPUDESC4.Byte
#define MPUDESC4_HIGH_ADDR11            _MPUDESC4.Bits.HIGH_ADDR11
#define MPUDESC4_HIGH_ADDR12            _MPUDESC4.Bits.HIGH_ADDR12
#define MPUDESC4_HIGH_ADDR13            _MPUDESC4.Bits.HIGH_ADDR13
#define MPUDESC4_HIGH_ADDR14            _MPUDESC4.Bits.HIGH_ADDR14
#define MPUDESC4_HIGH_ADDR15            _MPUDESC4.Bits.HIGH_ADDR15
#define MPUDESC4_HIGH_ADDR16            _MPUDESC4.Bits.HIGH_ADDR16
#define MPUDESC4_HIGH_ADDR17            _MPUDESC4.Bits.HIGH_ADDR17
#define MPUDESC4_HIGH_ADDR18            _MPUDESC4.Bits.HIGH_ADDR18

