frostfire45/Codewarrior/Lib/hc12c/include/mc9s12xeq384.h
/*** CAN2IDMR2 - MSCAN2 Identifier Mask Register 2; 0x000001D6 ***/
typedef union {
  byte Byte;
  struct {
    byte AM0         :1;                                       /* Acceptance Mask Bit 0 */
    byte AM1         :1;                                       /* Acceptance Mask Bit 1 */
    byte AM2         :1;                                       /* Acceptance Mask Bit 2 */
    byte AM3         :1;                                       /* Acceptance Mask Bit 3 */
    byte AM4         :1;                                       /* Acceptance Mask Bit 4 */
    byte AM5         :1;                                       /* Acceptance Mask Bit 5 */
    byte AM6         :1;                                       /* Acceptance Mask Bit 6 */
    byte AM7         :1;                                       /* Acceptance Mask Bit 7 */
  } Bits;
} CAN2IDMR2STR;
extern volatile CAN2IDMR2STR _CAN2IDMR2 @(REG_BASE + 0x000001D6UL);
#define CAN2IDMR2                       _CAN2IDMR2.Byte
#define CAN2IDMR2_AM0                   _CAN2IDMR2.Bits.AM0
#define CAN2IDMR2_AM1                   _CAN2IDMR2.Bits.AM1
#define CAN2IDMR2_AM2                   _CAN2IDMR2.Bits.AM2
#define CAN2IDMR2_AM3                   _CAN2IDMR2.Bits.AM3
#define CAN2IDMR2_AM4                   _CAN2IDMR2.Bits.AM4
#define CAN2IDMR2_AM5                   _CAN2IDMR2.Bits.AM5
#define CAN2IDMR2_AM6                   _CAN2IDMR2.Bits.AM6
#define CAN2IDMR2_AM7                   _CAN2IDMR2.Bits.AM7

#define CAN2IDMR2_AM0_MASK              1U
#define CAN2IDMR2_AM1_MASK              2U
#define CAN2IDMR2_AM2_MASK              4U
#define CAN2IDMR2_AM3_MASK              8U
#define CAN2IDMR2_AM4_MASK              16U
#define CAN2IDMR2_AM5_MASK              32U
#define CAN2IDMR2_AM6_MASK              64U
#define CAN2IDMR2_AM7_MASK              128U


/*** CAN2IDMR3 - MSCAN2 Identifier Mask Register 3; 0x000001D7 ***/
typedef union {
  byte Byte;
  struct {
    byte AM0         :1;                                       /* Acceptance Mask Bit 0 */
    byte AM1         :1;                                       /* Acceptance Mask Bit 1 */
    byte AM2         :1;                                       /* Acceptance Mask Bit 2 */
    byte AM3         :1;                                       /* Acceptance Mask Bit 3 */
    byte AM4         :1;                                       /* Acceptance Mask Bit 4 */
    byte AM5         :1;                                       /* Acceptance Mask Bit 5 */
    byte AM6         :1;                                       /* Acceptance Mask Bit 6 */
    byte AM7         :1;                                       /* Acceptance Mask Bit 7 */
  } Bits;
} CAN2IDMR3STR;
extern volatile CAN2IDMR3STR _CAN2IDMR3 @(REG_BASE + 0x000001D7UL);
#define CAN2IDMR3                       _CAN2IDMR3.Byte
#define CAN2IDMR3_AM0                   _CAN2IDMR3.Bits.AM0
#define CAN2IDMR3_AM1                   _CAN2IDMR3.Bits.AM1
#define CAN2IDMR3_AM2                   _CAN2IDMR3.Bits.AM2
#define CAN2IDMR3_AM3                   _CAN2IDMR3.Bits.AM3
#define CAN2IDMR3_AM4                   _CAN2IDMR3.Bits.AM4
#define CAN2IDMR3_AM5                   _CAN2IDMR3.Bits.AM5
#define CAN2IDMR3_AM6                   _CAN2IDMR3.Bits.AM6
#define CAN2IDMR3_AM7                   _CAN2IDMR3.Bits.AM7

#define CAN2IDMR3_AM0_MASK              1U
#define CAN2IDMR3_AM1_MASK              2U
#define CAN2IDMR3_AM2_MASK              4U
#define CAN2IDMR3_AM3_MASK              8U
#define CAN2IDMR3_AM4_MASK              16U
#define CAN2IDMR3_AM5_MASK              32U
#define CAN2IDMR3_AM6_MASK              64U
#define CAN2IDMR3_AM7_MASK              128U


/*** CAN2IDAR4 - MSCAN2 Identifier Acceptance Register 4; 0x000001D8 ***/
typedef union {
  byte Byte;
  struct {
    byte AC0         :1;                                       /* Acceptance Code Bit 0 */
    byte AC1         :1;                                       /* Acceptance Code Bit 1 */
    byte AC2         :1;                                       /* Acceptance Code Bit 2 */
    byte AC3         :1;                                       /* Acceptance Code Bit 3 */
    byte AC4         :1;                                       /* Acceptance Code Bit 4 */
    byte AC5         :1;                                       /* Acceptance Code Bit 5 */
    byte AC6         :1;                                       /* Acceptance Code Bit 6 */
    byte AC7         :1;                                       /* Acceptance Code Bit 7 */
  } Bits;
} CAN2IDAR4STR;
extern volatile CAN2IDAR4STR _CAN2IDAR4 @(REG_BASE + 0x000001D8UL);
#define CAN2IDAR4                       _CAN2IDAR4.Byte
#define CAN2IDAR4_AC0                   _CAN2IDAR4.Bits.AC0
#define CAN2IDAR4_AC1                   _CAN2IDAR4.Bits.AC1
#define CAN2IDAR4_AC2                   _CAN2IDAR4.Bits.AC2
#define CAN2IDAR4_AC3                   _CAN2IDAR4.Bits.AC3
#define CAN2IDAR4_AC4                   _CAN2IDAR4.Bits.AC4
#define CAN2IDAR4_AC5                   _CAN2IDAR4.Bits.AC5
#define CAN2IDAR4_AC6                   _CAN2IDAR4.Bits.AC6
#define CAN2IDAR4_AC7                   _CAN2IDAR4.Bits.AC7

#define CAN2IDAR4_AC0_MASK              1U
#define CAN2IDAR4_AC1_MASK              2U
#define CAN2IDAR4_AC2_MASK              4U
#define CAN2IDAR4_AC3_MASK              8U
#define CAN2IDAR4_AC4_MASK              16U
#define CAN2IDAR4_AC5_MASK              32U
#define CAN2IDAR4_AC6_MASK              64U
#define CAN2IDAR4_AC7_MASK              128U


/*** CAN2IDAR5 - MSCAN2 Identifier Acceptance Register 5; 0x000001D9 ***/
typedef union {
  byte Byte;
  struct {
    byte AC0         :1;                                       /* Acceptance Code Bit 0 */
    byte AC1         :1;                                       /* Acceptance Code Bit 1 */
    byte AC2         :1;                                       /* Acceptance Code Bit 2 */
    byte AC3         :1;                                       /* Acceptance Code Bit 3 */
    byte AC4         :1;                                       /* Acceptance Code Bit 4 */
    byte AC5         :1;                                       /* Acceptance Code Bit 5 */
    byte AC6         :1;                                       /* Acceptance Code Bit 6 */
    byte AC7         :1;                                       /* Acceptance Code Bit 7 */
  } Bits;
} CAN2IDAR5STR;
