frostfire45/Codewarrior/Lib/hc12c/include/mc9s12xeq384.h
#define CAN2RXIDR0_ID21_MASK            1U
#define CAN2RXIDR0_ID22_MASK            2U
#define CAN2RXIDR0_ID23_MASK            4U
#define CAN2RXIDR0_ID24_MASK            8U
#define CAN2RXIDR0_ID25_MASK            16U
#define CAN2RXIDR0_ID26_MASK            32U
#define CAN2RXIDR0_ID27_MASK            64U
#define CAN2RXIDR0_ID28_MASK            128U


/*** CAN2RXIDR1 - MSCAN2 Receive Identifier Register 1; 0x000001E1 ***/
typedef union {
  byte Byte;
  struct {
    byte ID15        :1;                                       /* Extended format identifier Bit 15 */
    byte ID16        :1;                                       /* Extended format identifier Bit 16 */
    byte ID17        :1;                                       /* Extended format identifier Bit 17 */
    byte IDE         :1;                                       /* ID Extended */
    byte SRR         :1;                                       /* Substitute Remote Request */
    byte ID18        :1;                                       /* Extended format identifier Bit 18 */
    byte ID19        :1;                                       /* Extended format identifier Bit 19 */
    byte ID20        :1;                                       /* Extended format identifier Bit 20 */
  } Bits;
  struct {
    byte grpID_15 :3;
    byte         :1;
    byte         :1;
    byte grpID_18 :3;
  } MergedBits;
} CAN2RXIDR1STR;
extern volatile CAN2RXIDR1STR _CAN2RXIDR1 @(REG_BASE + 0x000001E1UL);
#define CAN2RXIDR1                      _CAN2RXIDR1.Byte
#define CAN2RXIDR1_ID15                 _CAN2RXIDR1.Bits.ID15
#define CAN2RXIDR1_ID16                 _CAN2RXIDR1.Bits.ID16
#define CAN2RXIDR1_ID17                 _CAN2RXIDR1.Bits.ID17
#define CAN2RXIDR1_IDE                  _CAN2RXIDR1.Bits.IDE
#define CAN2RXIDR1_SRR                  _CAN2RXIDR1.Bits.SRR
#define CAN2RXIDR1_ID18                 _CAN2RXIDR1.Bits.ID18
#define CAN2RXIDR1_ID19                 _CAN2RXIDR1.Bits.ID19
#define CAN2RXIDR1_ID20                 _CAN2RXIDR1.Bits.ID20
#define CAN2RXIDR1_ID_15                _CAN2RXIDR1.MergedBits.grpID_15
#define CAN2RXIDR1_ID_18                _CAN2RXIDR1.MergedBits.grpID_18
#define CAN2RXIDR1_ID                   CAN2RXIDR1_ID_15

#define CAN2RXIDR1_ID15_MASK            1U
#define CAN2RXIDR1_ID16_MASK            2U
#define CAN2RXIDR1_ID17_MASK            4U
#define CAN2RXIDR1_IDE_MASK             8U
#define CAN2RXIDR1_SRR_MASK             16U
#define CAN2RXIDR1_ID18_MASK            32U
#define CAN2RXIDR1_ID19_MASK            64U
#define CAN2RXIDR1_ID20_MASK            128U
#define CAN2RXIDR1_ID_15_MASK           7U
#define CAN2RXIDR1_ID_15_BITNUM         0U
#define CAN2RXIDR1_ID_18_MASK           224U
#define CAN2RXIDR1_ID_18_BITNUM         5U


/*** CAN2RXIDR2 - MSCAN2 Receive Identifier Register 2; 0x000001E2 ***/
typedef union {
  byte Byte;
  struct {
    byte ID7         :1;                                       /* Extended format identifier Bit 7 */
    byte ID8         :1;                                       /* Extended format identifier Bit 8 */
    byte ID9         :1;                                       /* Extended format identifier Bit 9 */
    byte ID10        :1;                                       /* Extended format identifier Bit 10 */
    byte ID11        :1;                                       /* Extended format identifier Bit 11 */
    byte ID12        :1;                                       /* Extended format identifier Bit 12 */
    byte ID13        :1;                                       /* Extended format identifier Bit 13 */
    byte ID14        :1;                                       /* Extended format identifier Bit 14 */
  } Bits;
} CAN2RXIDR2STR;
extern volatile CAN2RXIDR2STR _CAN2RXIDR2 @(REG_BASE + 0x000001E2UL);
#define CAN2RXIDR2                      _CAN2RXIDR2.Byte
#define CAN2RXIDR2_ID7                  _CAN2RXIDR2.Bits.ID7
#define CAN2RXIDR2_ID8                  _CAN2RXIDR2.Bits.ID8
#define CAN2RXIDR2_ID9                  _CAN2RXIDR2.Bits.ID9
#define CAN2RXIDR2_ID10                 _CAN2RXIDR2.Bits.ID10
#define CAN2RXIDR2_ID11                 _CAN2RXIDR2.Bits.ID11
#define CAN2RXIDR2_ID12                 _CAN2RXIDR2.Bits.ID12
#define CAN2RXIDR2_ID13                 _CAN2RXIDR2.Bits.ID13
#define CAN2RXIDR2_ID14                 _CAN2RXIDR2.Bits.ID14

#define CAN2RXIDR2_ID7_MASK             1U
#define CAN2RXIDR2_ID8_MASK             2U
#define CAN2RXIDR2_ID9_MASK             4U
#define CAN2RXIDR2_ID10_MASK            8U
#define CAN2RXIDR2_ID11_MASK            16U
#define CAN2RXIDR2_ID12_MASK            32U
#define CAN2RXIDR2_ID13_MASK            64U
#define CAN2RXIDR2_ID14_MASK            128U


/*** CAN2RXIDR3 - MSCAN2 Receive Identifier Register 3; 0x000001E3 ***/
typedef union {
  byte Byte;
  struct {
    byte RTR         :1;                                       /* Remote Transmission Request */
    byte ID0         :1;                                       /* Extended format identifier Bit 0 */
    byte ID1         :1;                                       /* Extended format identifier Bit 1 */
    byte ID2         :1;                                       /* Extended format identifier Bit 2 */
    byte ID3         :1;                                       /* Extended format identifier Bit 3 */
    byte ID4         :1;                                       /* Extended format identifier Bit 4 */
    byte ID5         :1;                                       /* Extended format identifier Bit 5 */
    byte ID6         :1;                                       /* Extended format identifier Bit 6 */
  } Bits;
  struct {
    byte         :1;
    byte grpID   :7;
  } MergedBits;
} CAN2RXIDR3STR;
extern volatile CAN2RXIDR3STR _CAN2RXIDR3 @(REG_BASE + 0x000001E3UL);
#define CAN2RXIDR3                      _CAN2RXIDR3.Byte
#define CAN2RXIDR3_RTR                  _CAN2RXIDR3.Bits.RTR
#define CAN2RXIDR3_ID0                  _CAN2RXIDR3.Bits.ID0
#define CAN2RXIDR3_ID1                  _CAN2RXIDR3.Bits.ID1
#define CAN2RXIDR3_ID2                  _CAN2RXIDR3.Bits.ID2
#define CAN2RXIDR3_ID3                  _CAN2RXIDR3.Bits.ID3
#define CAN2RXIDR3_ID4                  _CAN2RXIDR3.Bits.ID4
#define CAN2RXIDR3_ID5                  _CAN2RXIDR3.Bits.ID5
#define CAN2RXIDR3_ID6                  _CAN2RXIDR3.Bits.ID6
#define CAN2RXIDR3_ID                   _CAN2RXIDR3.MergedBits.grpID

#define CAN2RXIDR3_RTR_MASK             1U
#define CAN2RXIDR3_ID0_MASK             2U
#define CAN2RXIDR3_ID1_MASK             4U
#define CAN2RXIDR3_ID2_MASK             8U
#define CAN2RXIDR3_ID3_MASK             16U
#define CAN2RXIDR3_ID4_MASK             32U
#define CAN2RXIDR3_ID5_MASK             64U
#define CAN2RXIDR3_ID6_MASK             128U
#define CAN2RXIDR3_ID_MASK              254U
#define CAN2RXIDR3_ID_BITNUM            1U


