frostfire45/Codewarrior/Lib/hc12c/include/mc9s12xeq384.h
    #define PT0AD1_PT0AD10_MASK         1U
    #define PT0AD1_PT0AD11_MASK         2U
    #define PT0AD1_PT0AD12_MASK         4U
    #define PT0AD1_PT0AD13_MASK         8U
    #define PT0AD1_PT0AD14_MASK         16U
    #define PT0AD1_PT0AD15_MASK         32U
    #define PT0AD1_PT0AD16_MASK         64U
    #define PT0AD1_PT0AD17_MASK         128U
    

    /*** PT1AD1 - Port AD1L Data Register; 0x00000279 ***/
    union {
      byte Byte;
      struct {
        byte PT1AD10     :1;                                       /* Port AD1 data bit 0 */
        byte PT1AD11     :1;                                       /* Port AD1 data bit 1 */
        byte PT1AD12     :1;                                       /* Port AD1 data bit 2 */
        byte PT1AD13     :1;                                       /* Port AD1 data bit 3 */
        byte PT1AD14     :1;                                       /* Port AD1 data bit 4 */
        byte PT1AD15     :1;                                       /* Port AD1 data bit 5 */
        byte PT1AD16     :1;                                       /* Port AD1 data bit 6 */
        byte PT1AD17     :1;                                       /* Port AD1 data bit 7 */
      } Bits;
    } PT1AD1STR;
    #define PT1AD1                      _PT01AD1.Overlap_STR.PT1AD1STR.Byte
    #define PT1AD1_PT1AD10              _PT01AD1.Overlap_STR.PT1AD1STR.Bits.PT1AD10
    #define PT1AD1_PT1AD11              _PT01AD1.Overlap_STR.PT1AD1STR.Bits.PT1AD11
    #define PT1AD1_PT1AD12              _PT01AD1.Overlap_STR.PT1AD1STR.Bits.PT1AD12
    #define PT1AD1_PT1AD13              _PT01AD1.Overlap_STR.PT1AD1STR.Bits.PT1AD13
    #define PT1AD1_PT1AD14              _PT01AD1.Overlap_STR.PT1AD1STR.Bits.PT1AD14
    #define PT1AD1_PT1AD15              _PT01AD1.Overlap_STR.PT1AD1STR.Bits.PT1AD15
    #define PT1AD1_PT1AD16              _PT01AD1.Overlap_STR.PT1AD1STR.Bits.PT1AD16
    #define PT1AD1_PT1AD17              _PT01AD1.Overlap_STR.PT1AD1STR.Bits.PT1AD17
    
    #define PT1AD1_PT1AD10_MASK         1U
    #define PT1AD1_PT1AD11_MASK         2U
    #define PT1AD1_PT1AD12_MASK         4U
    #define PT1AD1_PT1AD13_MASK         8U
    #define PT1AD1_PT1AD14_MASK         16U
    #define PT1AD1_PT1AD15_MASK         32U
    #define PT1AD1_PT1AD16_MASK         64U
    #define PT1AD1_PT1AD17_MASK         128U
    
  } Overlap_STR;

  struct {
    word PT1AD10     :1;                                       /* Port AD1 data bit 0 */
    word PT1AD11     :1;                                       /* Port AD1 data bit 1 */
    word PT1AD12     :1;                                       /* Port AD1 data bit 2 */
    word PT1AD13     :1;                                       /* Port AD1 data bit 3 */
    word PT1AD14     :1;                                       /* Port AD1 data bit 4 */
    word PT1AD15     :1;                                       /* Port AD1 data bit 5 */
    word PT1AD16     :1;                                       /* Port AD1 data bit 6 */
    word PT1AD17     :1;                                       /* Port AD1 data bit 7 */
    word PT0AD10     :1;                                       /* Port AD1 data bit 8 */
    word PT0AD11     :1;                                       /* Port AD1 data bit 9 */
    word PT0AD12     :1;                                       /* Port AD1 data bit 10 */
    word PT0AD13     :1;                                       /* Port AD1 data bit 11 */
    word PT0AD14     :1;                                       /* Port AD1 data bit 12 */
    word PT0AD15     :1;                                       /* Port AD1 data bit 13 */
    word PT0AD16     :1;                                       /* Port AD1 data bit 14 */
    word PT0AD17     :1;                                       /* Port AD1 data bit 15 */
  } Bits;
  struct {
    word grpPT1AD_10 :8;
    word grpPT0AD_10 :8;
  } MergedBits;
} PT01AD1STR;
extern volatile PT01AD1STR _PT01AD1 @(REG_BASE + 0x00000278UL);
#define PT01AD1                         _PT01AD1.Word
#define PT01AD1_PT1AD10                 _PT01AD1.Bits.PT1AD10
#define PT01AD1_PT1AD11                 _PT01AD1.Bits.PT1AD11
#define PT01AD1_PT1AD12                 _PT01AD1.Bits.PT1AD12
#define PT01AD1_PT1AD13                 _PT01AD1.Bits.PT1AD13
#define PT01AD1_PT1AD14                 _PT01AD1.Bits.PT1AD14
#define PT01AD1_PT1AD15                 _PT01AD1.Bits.PT1AD15
#define PT01AD1_PT1AD16                 _PT01AD1.Bits.PT1AD16
#define PT01AD1_PT1AD17                 _PT01AD1.Bits.PT1AD17
#define PT01AD1_PT0AD10                 _PT01AD1.Bits.PT0AD10
#define PT01AD1_PT0AD11                 _PT01AD1.Bits.PT0AD11
#define PT01AD1_PT0AD12                 _PT01AD1.Bits.PT0AD12
#define PT01AD1_PT0AD13                 _PT01AD1.Bits.PT0AD13
#define PT01AD1_PT0AD14                 _PT01AD1.Bits.PT0AD14
#define PT01AD1_PT0AD15                 _PT01AD1.Bits.PT0AD15
#define PT01AD1_PT0AD16                 _PT01AD1.Bits.PT0AD16
#define PT01AD1_PT0AD17                 _PT01AD1.Bits.PT0AD17
#define PT01AD1_PT1AD_10                _PT01AD1.MergedBits.grpPT1AD_10
#define PT01AD1_PT0AD_10                _PT01AD1.MergedBits.grpPT0AD_10
#define PT01AD1_PT1AD                   PT01AD1_PT1AD_10
#define PT01AD1_PT0AD                   PT01AD1_PT0AD_10

#define PT01AD1_PT1AD10_MASK            1U
#define PT01AD1_PT1AD11_MASK            2U
#define PT01AD1_PT1AD12_MASK            4U
#define PT01AD1_PT1AD13_MASK            8U
#define PT01AD1_PT1AD14_MASK            16U
#define PT01AD1_PT1AD15_MASK            32U
#define PT01AD1_PT1AD16_MASK            64U
#define PT01AD1_PT1AD17_MASK            128U
#define PT01AD1_PT0AD10_MASK            256U
#define PT01AD1_PT0AD11_MASK            512U
#define PT01AD1_PT0AD12_MASK            1024U
#define PT01AD1_PT0AD13_MASK            2048U
#define PT01AD1_PT0AD14_MASK            4096U
#define PT01AD1_PT0AD15_MASK            8192U
#define PT01AD1_PT0AD16_MASK            16384U
#define PT01AD1_PT0AD17_MASK            32768U
#define PT01AD1_PT1AD_10_MASK           255U
#define PT01AD1_PT1AD_10_BITNUM         0U
#define PT01AD1_PT0AD_10_MASK           65280U
#define PT01AD1_PT0AD_10_BITNUM         8U


/*** DDR01AD1 - Port AD1 Data Direction Register; 0x0000027A ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** DDR0AD1 - Port AD1H Data Direction Register; 0x0000027A ***/
    union {
      byte Byte;
      struct {
        byte DDR0AD10    :1;                                       /* Port AD1 data direction bit 0 */
        byte DDR0AD11    :1;                                       /* Port AD1 data direction bit 1 */
        byte DDR0AD12    :1;                                       /* Port AD1 data direction bit 2 */
        byte DDR0AD13    :1;                                       /* Port AD1 data direction bit 3 */
        byte DDR0AD14    :1;                                       /* Port AD1 data direction bit 4 */
        byte DDR0AD15    :1;                                       /* Port AD1 data direction bit 5 */
        byte DDR0AD16    :1;                                       /* Port AD1 data direction bit 6 */
        byte DDR0AD17    :1;                                       /* Port AD1 data direction bit 7 */
      } Bits;
    } DDR0AD1STR;
    #define DDR0AD1                     _DDR01AD1.Overlap_STR.DDR0AD1STR.Byte
    #define DDR0AD1_DDR0AD10            _DDR01AD1.Overlap_STR.DDR0AD1STR.Bits.DDR0AD10
    #define DDR0AD1_DDR0AD11            _DDR01AD1.Overlap_STR.DDR0AD1STR.Bits.DDR0AD11
    #define DDR0AD1_DDR0AD12            _DDR01AD1.Overlap_STR.DDR0AD1STR.Bits.DDR0AD12
    #define DDR0AD1_DDR0AD13            _DDR01AD1.Overlap_STR.DDR0AD1STR.Bits.DDR0AD13
    #define DDR0AD1_DDR0AD14            _DDR01AD1.Overlap_STR.DDR0AD1STR.Bits.DDR0AD14
    #define DDR0AD1_DDR0AD15            _DDR01AD1.Overlap_STR.DDR0AD1STR.Bits.DDR0AD15
    #define DDR0AD1_DDR0AD16            _DDR01AD1.Overlap_STR.DDR0AD1STR.Bits.DDR0AD16
    #define DDR0AD1_DDR0AD17            _DDR01AD1.Overlap_STR.DDR0AD1STR.Bits.DDR0AD17
    
    #define DDR0AD1_DDR0AD10_MASK       1U
    #define DDR0AD1_DDR0AD11_MASK       2U
    #define DDR0AD1_DDR0AD12_MASK       4U
    #define DDR0AD1_DDR0AD13_MASK       8U
    #define DDR0AD1_DDR0AD14_MASK       16U
    #define DDR0AD1_DDR0AD15_MASK       32U
    #define DDR0AD1_DDR0AD16_MASK       64U
    #define DDR0AD1_DDR0AD17_MASK       128U
    

    /*** DDR1AD1 - Port AD1L Data Direction Register; 0x0000027B ***/
    union {
      byte Byte;
      struct {
        byte DDR1AD10    :1;                                       /* Port AD1 data direction bit 0 */
        byte DDR1AD11    :1;                                       /* Port AD1 data direction bit 1 */
        byte DDR1AD12    :1;                                       /* Port AD1 data direction bit 2 */
        byte DDR1AD13    :1;                                       /* Port AD1 data direction bit 3 */
        byte DDR1AD14    :1;                                       /* Port AD1 data direction bit 4 */
        byte DDR1AD15    :1;                                       /* Port AD1 data direction bit 5 */
        byte DDR1AD16    :1;                                       /* Port AD1 data direction bit 6 */
        byte DDR1AD17    :1;                                       /* Port AD1 data direction bit 7 */
      } Bits;
    } DDR1AD1STR;
    #define DDR1AD1                     _DDR01AD1.Overlap_STR.DDR1AD1STR.Byte
    #define DDR1AD1_DDR1AD10            _DDR01AD1.Overlap_STR.DDR1AD1STR.Bits.DDR1AD10
    #define DDR1AD1_DDR1AD11            _DDR01AD1.Overlap_STR.DDR1AD1STR.Bits.DDR1AD11
    #define DDR1AD1_DDR1AD12            _DDR01AD1.Overlap_STR.DDR1AD1STR.Bits.DDR1AD12
    #define DDR1AD1_DDR1AD13            _DDR01AD1.Overlap_STR.DDR1AD1STR.Bits.DDR1AD13
    #define DDR1AD1_DDR1AD14            _DDR01AD1.Overlap_STR.DDR1AD1STR.Bits.DDR1AD14
    #define DDR1AD1_DDR1AD15            _DDR01AD1.Overlap_STR.DDR1AD1STR.Bits.DDR1AD15
    #define DDR1AD1_DDR1AD16            _DDR01AD1.Overlap_STR.DDR1AD1STR.Bits.DDR1AD16
    #define DDR1AD1_DDR1AD17            _DDR01AD1.Overlap_STR.DDR1AD1STR.Bits.DDR1AD17
    
    #define DDR1AD1_DDR1AD10_MASK       1U
    #define DDR1AD1_DDR1AD11_MASK       2U
    #define DDR1AD1_DDR1AD12_MASK       4U
    #define DDR1AD1_DDR1AD13_MASK       8U
    #define DDR1AD1_DDR1AD14_MASK       16U
    #define DDR1AD1_DDR1AD15_MASK       32U
    #define DDR1AD1_DDR1AD16_MASK       64U
    #define DDR1AD1_DDR1AD17_MASK       128U
    
  } Overlap_STR;

