frostfire45/Codewarrior/Lib/hc12c/include/mc9s12xeq384.h
  struct {
    word DDR1AD10    :1;                                       /* Port AD1 data direction bit 0 */
    word DDR1AD11    :1;                                       /* Port AD1 data direction bit 1 */
    word DDR1AD12    :1;                                       /* Port AD1 data direction bit 2 */
    word DDR1AD13    :1;                                       /* Port AD1 data direction bit 3 */
    word DDR1AD14    :1;                                       /* Port AD1 data direction bit 4 */
    word DDR1AD15    :1;                                       /* Port AD1 data direction bit 5 */
    word DDR1AD16    :1;                                       /* Port AD1 data direction bit 6 */
    word DDR1AD17    :1;                                       /* Port AD1 data direction bit 7 */
    word DDR0AD10    :1;                                       /* Port AD1 data direction bit 8 */
    word DDR0AD11    :1;                                       /* Port AD1 data direction bit 9 */
    word DDR0AD12    :1;                                       /* Port AD1 data direction bit 10 */
    word DDR0AD13    :1;                                       /* Port AD1 data direction bit 11 */
    word DDR0AD14    :1;                                       /* Port AD1 data direction bit 12 */
    word DDR0AD15    :1;                                       /* Port AD1 data direction bit 13 */
    word DDR0AD16    :1;                                       /* Port AD1 data direction bit 14 */
    word DDR0AD17    :1;                                       /* Port AD1 data direction bit 15 */
  } Bits;
  struct {
    word grpDDR1AD_10 :8;
    word grpDDR0AD_10 :8;
  } MergedBits;
} DDR01AD1STR;
extern volatile DDR01AD1STR _DDR01AD1 @(REG_BASE + 0x0000027AUL);
#define DDR01AD1                        _DDR01AD1.Word
#define DDR01AD1_DDR1AD10               _DDR01AD1.Bits.DDR1AD10
#define DDR01AD1_DDR1AD11               _DDR01AD1.Bits.DDR1AD11
#define DDR01AD1_DDR1AD12               _DDR01AD1.Bits.DDR1AD12
#define DDR01AD1_DDR1AD13               _DDR01AD1.Bits.DDR1AD13
#define DDR01AD1_DDR1AD14               _DDR01AD1.Bits.DDR1AD14
#define DDR01AD1_DDR1AD15               _DDR01AD1.Bits.DDR1AD15
#define DDR01AD1_DDR1AD16               _DDR01AD1.Bits.DDR1AD16
#define DDR01AD1_DDR1AD17               _DDR01AD1.Bits.DDR1AD17
#define DDR01AD1_DDR0AD10               _DDR01AD1.Bits.DDR0AD10
#define DDR01AD1_DDR0AD11               _DDR01AD1.Bits.DDR0AD11
#define DDR01AD1_DDR0AD12               _DDR01AD1.Bits.DDR0AD12
#define DDR01AD1_DDR0AD13               _DDR01AD1.Bits.DDR0AD13
#define DDR01AD1_DDR0AD14               _DDR01AD1.Bits.DDR0AD14
#define DDR01AD1_DDR0AD15               _DDR01AD1.Bits.DDR0AD15
#define DDR01AD1_DDR0AD16               _DDR01AD1.Bits.DDR0AD16
#define DDR01AD1_DDR0AD17               _DDR01AD1.Bits.DDR0AD17
#define DDR01AD1_DDR1AD_10              _DDR01AD1.MergedBits.grpDDR1AD_10
#define DDR01AD1_DDR0AD_10              _DDR01AD1.MergedBits.grpDDR0AD_10
#define DDR01AD1_DDR1AD                 DDR01AD1_DDR1AD_10
#define DDR01AD1_DDR0AD                 DDR01AD1_DDR0AD_10

#define DDR01AD1_DDR1AD10_MASK          1U
#define DDR01AD1_DDR1AD11_MASK          2U
#define DDR01AD1_DDR1AD12_MASK          4U
#define DDR01AD1_DDR1AD13_MASK          8U
#define DDR01AD1_DDR1AD14_MASK          16U
#define DDR01AD1_DDR1AD15_MASK          32U
#define DDR01AD1_DDR1AD16_MASK          64U
#define DDR01AD1_DDR1AD17_MASK          128U
#define DDR01AD1_DDR0AD10_MASK          256U
#define DDR01AD1_DDR0AD11_MASK          512U
#define DDR01AD1_DDR0AD12_MASK          1024U
#define DDR01AD1_DDR0AD13_MASK          2048U
#define DDR01AD1_DDR0AD14_MASK          4096U
#define DDR01AD1_DDR0AD15_MASK          8192U
#define DDR01AD1_DDR0AD16_MASK          16384U
#define DDR01AD1_DDR0AD17_MASK          32768U
#define DDR01AD1_DDR1AD_10_MASK         255U
#define DDR01AD1_DDR1AD_10_BITNUM       0U
#define DDR01AD1_DDR0AD_10_MASK         65280U
#define DDR01AD1_DDR0AD_10_BITNUM       8U


/*** RDR01AD1 - Port AD1 Reduced Drive Register; 0x0000027C ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** RDR0AD1 - Port AD1H Reduced Drive Register; 0x0000027C ***/
    union {
      byte Byte;
      struct {
        byte RDR0AD10    :1;                                       /* Port AD1H reduced drive bit 0 */
        byte RDR0AD11    :1;                                       /* Port AD1H reduced drive bit 1 */
        byte RDR0AD12    :1;                                       /* Port AD1H reduced drive bit 2 */
        byte RDR0AD13    :1;                                       /* Port AD1H reduced drive bit 3 */
        byte RDR0AD14    :1;                                       /* Port AD1H reduced drive bit 4 */
        byte RDR0AD15    :1;                                       /* Port AD1H reduced drive bit 5 */
        byte RDR0AD16    :1;                                       /* Port AD1H reduced drive bit 6 */
        byte RDR0AD17    :1;                                       /* Port AD1H reduced drive bit 7 */
      } Bits;
    } RDR0AD1STR;
    #define RDR0AD1                     _RDR01AD1.Overlap_STR.RDR0AD1STR.Byte
    #define RDR0AD1_RDR0AD10            _RDR01AD1.Overlap_STR.RDR0AD1STR.Bits.RDR0AD10
    #define RDR0AD1_RDR0AD11            _RDR01AD1.Overlap_STR.RDR0AD1STR.Bits.RDR0AD11
    #define RDR0AD1_RDR0AD12            _RDR01AD1.Overlap_STR.RDR0AD1STR.Bits.RDR0AD12
    #define RDR0AD1_RDR0AD13            _RDR01AD1.Overlap_STR.RDR0AD1STR.Bits.RDR0AD13
    #define RDR0AD1_RDR0AD14            _RDR01AD1.Overlap_STR.RDR0AD1STR.Bits.RDR0AD14
    #define RDR0AD1_RDR0AD15            _RDR01AD1.Overlap_STR.RDR0AD1STR.Bits.RDR0AD15
    #define RDR0AD1_RDR0AD16            _RDR01AD1.Overlap_STR.RDR0AD1STR.Bits.RDR0AD16
    #define RDR0AD1_RDR0AD17            _RDR01AD1.Overlap_STR.RDR0AD1STR.Bits.RDR0AD17
    
    #define RDR0AD1_RDR0AD10_MASK       1U
    #define RDR0AD1_RDR0AD11_MASK       2U
    #define RDR0AD1_RDR0AD12_MASK       4U
    #define RDR0AD1_RDR0AD13_MASK       8U
    #define RDR0AD1_RDR0AD14_MASK       16U
    #define RDR0AD1_RDR0AD15_MASK       32U
    #define RDR0AD1_RDR0AD16_MASK       64U
    #define RDR0AD1_RDR0AD17_MASK       128U
    

