frostfire45/Codewarrior/Lib/hc12c/include/mc9s12xeq384.h
extern volatile CAN4IDMR5STR _CAN4IDMR5 @(REG_BASE + 0x0000029DUL);
#define CAN4IDMR5                       _CAN4IDMR5.Byte
#define CAN4IDMR5_AM0                   _CAN4IDMR5.Bits.AM0
#define CAN4IDMR5_AM1                   _CAN4IDMR5.Bits.AM1
#define CAN4IDMR5_AM2                   _CAN4IDMR5.Bits.AM2
#define CAN4IDMR5_AM3                   _CAN4IDMR5.Bits.AM3
#define CAN4IDMR5_AM4                   _CAN4IDMR5.Bits.AM4
#define CAN4IDMR5_AM5                   _CAN4IDMR5.Bits.AM5
#define CAN4IDMR5_AM6                   _CAN4IDMR5.Bits.AM6
#define CAN4IDMR5_AM7                   _CAN4IDMR5.Bits.AM7

#define CAN4IDMR5_AM0_MASK              1U
#define CAN4IDMR5_AM1_MASK              2U
#define CAN4IDMR5_AM2_MASK              4U
#define CAN4IDMR5_AM3_MASK              8U
#define CAN4IDMR5_AM4_MASK              16U
#define CAN4IDMR5_AM5_MASK              32U
#define CAN4IDMR5_AM6_MASK              64U
#define CAN4IDMR5_AM7_MASK              128U


/*** CAN4IDMR6 - MSCAN4 Identifier Mask Register 6; 0x0000029E ***/
typedef union {
  byte Byte;
  struct {
    byte AM0         :1;                                       /* Acceptance Mask Bit 0 */
    byte AM1         :1;                                       /* Acceptance Mask Bit 1 */
    byte AM2         :1;                                       /* Acceptance Mask Bit 2 */
    byte AM3         :1;                                       /* Acceptance Mask Bit 3 */
    byte AM4         :1;                                       /* Acceptance Mask Bit 4 */
    byte AM5         :1;                                       /* Acceptance Mask Bit 5 */
    byte AM6         :1;                                       /* Acceptance Mask Bit 6 */
    byte AM7         :1;                                       /* Acceptance Mask Bit 7 */
  } Bits;
} CAN4IDMR6STR;
extern volatile CAN4IDMR6STR _CAN4IDMR6 @(REG_BASE + 0x0000029EUL);
#define CAN4IDMR6                       _CAN4IDMR6.Byte
#define CAN4IDMR6_AM0                   _CAN4IDMR6.Bits.AM0
#define CAN4IDMR6_AM1                   _CAN4IDMR6.Bits.AM1
#define CAN4IDMR6_AM2                   _CAN4IDMR6.Bits.AM2
#define CAN4IDMR6_AM3                   _CAN4IDMR6.Bits.AM3
#define CAN4IDMR6_AM4                   _CAN4IDMR6.Bits.AM4
#define CAN4IDMR6_AM5                   _CAN4IDMR6.Bits.AM5
#define CAN4IDMR6_AM6                   _CAN4IDMR6.Bits.AM6
#define CAN4IDMR6_AM7                   _CAN4IDMR6.Bits.AM7

#define CAN4IDMR6_AM0_MASK              1U
#define CAN4IDMR6_AM1_MASK              2U
#define CAN4IDMR6_AM2_MASK              4U
#define CAN4IDMR6_AM3_MASK              8U
#define CAN4IDMR6_AM4_MASK              16U
#define CAN4IDMR6_AM5_MASK              32U
#define CAN4IDMR6_AM6_MASK              64U
#define CAN4IDMR6_AM7_MASK              128U


/*** CAN4IDMR7 - MSCAN4 Identifier Mask Register 7; 0x0000029F ***/
typedef union {
  byte Byte;
  struct {
    byte AM0         :1;                                       /* Acceptance Mask Bit 0 */
    byte AM1         :1;                                       /* Acceptance Mask Bit 1 */
    byte AM2         :1;                                       /* Acceptance Mask Bit 2 */
    byte AM3         :1;                                       /* Acceptance Mask Bit 3 */
    byte AM4         :1;                                       /* Acceptance Mask Bit 4 */
    byte AM5         :1;                                       /* Acceptance Mask Bit 5 */
    byte AM6         :1;                                       /* Acceptance Mask Bit 6 */
    byte AM7         :1;                                       /* Acceptance Mask Bit 7 */
  } Bits;
} CAN4IDMR7STR;
extern volatile CAN4IDMR7STR _CAN4IDMR7 @(REG_BASE + 0x0000029FUL);
#define CAN4IDMR7                       _CAN4IDMR7.Byte
#define CAN4IDMR7_AM0                   _CAN4IDMR7.Bits.AM0
#define CAN4IDMR7_AM1                   _CAN4IDMR7.Bits.AM1
#define CAN4IDMR7_AM2                   _CAN4IDMR7.Bits.AM2
#define CAN4IDMR7_AM3                   _CAN4IDMR7.Bits.AM3
#define CAN4IDMR7_AM4                   _CAN4IDMR7.Bits.AM4
#define CAN4IDMR7_AM5                   _CAN4IDMR7.Bits.AM5
#define CAN4IDMR7_AM6                   _CAN4IDMR7.Bits.AM6
#define CAN4IDMR7_AM7                   _CAN4IDMR7.Bits.AM7

#define CAN4IDMR7_AM0_MASK              1U
#define CAN4IDMR7_AM1_MASK              2U
#define CAN4IDMR7_AM2_MASK              4U
#define CAN4IDMR7_AM3_MASK              8U
#define CAN4IDMR7_AM4_MASK              16U
#define CAN4IDMR7_AM5_MASK              32U
#define CAN4IDMR7_AM6_MASK              64U
#define CAN4IDMR7_AM7_MASK              128U


/*** CAN4RXIDR0 - MSCAN4 Receive Identifier Register 0; 0x000002A0 ***/
typedef union {
  byte Byte;
  struct {
    byte ID21        :1;                                       /* Extended format identifier Bit 21 */
    byte ID22        :1;                                       /* Extended format identifier Bit 22 */
    byte ID23        :1;                                       /* Extended format identifier Bit 23 */
    byte ID24        :1;                                       /* Extended format identifier Bit 24 */
    byte ID25        :1;                                       /* Extended format identifier Bit 25 */
    byte ID26        :1;                                       /* Extended format identifier Bit 26 */
    byte ID27        :1;                                       /* Extended format identifier Bit 27 */
    byte ID28        :1;                                       /* Extended format identifier Bit 28 */
  } Bits;
} CAN4RXIDR0STR;
extern volatile CAN4RXIDR0STR _CAN4RXIDR0 @(REG_BASE + 0x000002A0UL);
#define CAN4RXIDR0                      _CAN4RXIDR0.Byte
#define CAN4RXIDR0_ID21                 _CAN4RXIDR0.Bits.ID21
#define CAN4RXIDR0_ID22                 _CAN4RXIDR0.Bits.ID22
#define CAN4RXIDR0_ID23                 _CAN4RXIDR0.Bits.ID23
#define CAN4RXIDR0_ID24                 _CAN4RXIDR0.Bits.ID24
#define CAN4RXIDR0_ID25                 _CAN4RXIDR0.Bits.ID25
#define CAN4RXIDR0_ID26                 _CAN4RXIDR0.Bits.ID26
#define CAN4RXIDR0_ID27                 _CAN4RXIDR0.Bits.ID27
#define CAN4RXIDR0_ID28                 _CAN4RXIDR0.Bits.ID28
/* CAN4RXIDR_ARR: Access 4 CAN4RXIDRx registers in an array */
#define CAN4RXIDR_ARR                   ((volatile byte *) &CAN4RXIDR0)

#define CAN4RXIDR0_ID21_MASK            1U
#define CAN4RXIDR0_ID22_MASK            2U
#define CAN4RXIDR0_ID23_MASK            4U
#define CAN4RXIDR0_ID24_MASK            8U
#define CAN4RXIDR0_ID25_MASK            16U
#define CAN4RXIDR0_ID26_MASK            32U
#define CAN4RXIDR0_ID27_MASK            64U
#define CAN4RXIDR0_ID28_MASK            128U


/*** CAN4RXIDR1 - MSCAN4 Receive Identifier Register 1; 0x000002A1 ***/
typedef union {
  byte Byte;
  struct {
    byte ID15        :1;                                       /* Extended format identifier Bit 15 */
    byte ID16        :1;                                       /* Extended format identifier Bit 16 */
    byte ID17        :1;                                       /* Extended format identifier Bit 17 */
    byte IDE         :1;                                       /* ID Extended */
    byte SRR         :1;                                       /* Substitute Remote Request */
    byte ID18        :1;                                       /* Extended format identifier Bit 18 */
    byte ID19        :1;                                       /* Extended format identifier Bit 19 */
    byte ID20        :1;                                       /* Extended format identifier Bit 20 */
  } Bits;
  struct {
    byte grpID_15 :3;
    byte         :1;
    byte         :1;
    byte grpID_18 :3;
  } MergedBits;
} CAN4RXIDR1STR;
