frostfire45/Codewarrior/Lib/hc12c/include/mc9s12xeq384.h
  struct {
    word BIT0        :1;                                       /* Bit 0 */
    word BIT1        :1;                                       /* Bit 1 */
    word BIT2        :1;                                       /* Bit 2 */
    word BIT3        :1;                                       /* Bit 3 */
    word BIT4        :1;                                       /* Bit 4 */
    word BIT5        :1;                                       /* Bit 5 */
    word BIT6        :1;                                       /* Bit 6 */
    word BIT7        :1;                                       /* Bit 7 */
    word BIT8        :1;                                       /* Bit 8 */
    word BIT9        :1;                                       /* Bit 9 */
    word BIT10       :1;                                       /* Bit 10 */
    word BIT11       :1;                                       /* Bit 11 */
    word BIT12       :1;                                       /* Bit 12 */
    word BIT13       :1;                                       /* Bit 13 */
    word BIT14       :1;                                       /* Bit 14 */
    word BIT15       :1;                                       /* Bit 15 */
  } Bits;
} ATD0DR13STR;
extern volatile ATD0DR13STR _ATD0DR13 @(REG_BASE + 0x000002EAUL);
#define ATD0DR13                        _ATD0DR13.Word
#define ATD0DR13_BIT0                   _ATD0DR13.Bits.BIT0
#define ATD0DR13_BIT1                   _ATD0DR13.Bits.BIT1
#define ATD0DR13_BIT2                   _ATD0DR13.Bits.BIT2
#define ATD0DR13_BIT3                   _ATD0DR13.Bits.BIT3
#define ATD0DR13_BIT4                   _ATD0DR13.Bits.BIT4
#define ATD0DR13_BIT5                   _ATD0DR13.Bits.BIT5
#define ATD0DR13_BIT6                   _ATD0DR13.Bits.BIT6
#define ATD0DR13_BIT7                   _ATD0DR13.Bits.BIT7
#define ATD0DR13_BIT8                   _ATD0DR13.Bits.BIT8
#define ATD0DR13_BIT9                   _ATD0DR13.Bits.BIT9
#define ATD0DR13_BIT10                  _ATD0DR13.Bits.BIT10
#define ATD0DR13_BIT11                  _ATD0DR13.Bits.BIT11
#define ATD0DR13_BIT12                  _ATD0DR13.Bits.BIT12
#define ATD0DR13_BIT13                  _ATD0DR13.Bits.BIT13
#define ATD0DR13_BIT14                  _ATD0DR13.Bits.BIT14
#define ATD0DR13_BIT15                  _ATD0DR13.Bits.BIT15

#define ATD0DR13_BIT0_MASK              1U
#define ATD0DR13_BIT1_MASK              2U
#define ATD0DR13_BIT2_MASK              4U
#define ATD0DR13_BIT3_MASK              8U
#define ATD0DR13_BIT4_MASK              16U
#define ATD0DR13_BIT5_MASK              32U
#define ATD0DR13_BIT6_MASK              64U
#define ATD0DR13_BIT7_MASK              128U
#define ATD0DR13_BIT8_MASK              256U
#define ATD0DR13_BIT9_MASK              512U
#define ATD0DR13_BIT10_MASK             1024U
#define ATD0DR13_BIT11_MASK             2048U
#define ATD0DR13_BIT12_MASK             4096U
#define ATD0DR13_BIT13_MASK             8192U
#define ATD0DR13_BIT14_MASK             16384U
#define ATD0DR13_BIT15_MASK             32768U


/*** ATD0DR14 - ATD 0 Conversion Result Register 14; 0x000002EC ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** ATD0DR14H - ATD 0 Conversion Result Register 14 High; 0x000002EC ***/
    union {
      byte Byte;
      struct {
        byte BIT8        :1;                                       /* Bit 8 */
        byte BIT9        :1;                                       /* Bit 9 */
        byte BIT10       :1;                                       /* Bit 10 */
        byte BIT11       :1;                                       /* Bit 11 */
        byte BIT12       :1;                                       /* Bit 12 */
        byte BIT13       :1;                                       /* Bit 13 */
        byte BIT14       :1;                                       /* Bit 14 */
        byte BIT15       :1;                                       /* Bit 15 */
      } Bits;
    } ATD0DR14HSTR;
    #define ATD0DR14H                   _ATD0DR14.Overlap_STR.ATD0DR14HSTR.Byte
    #define ATD0DR14H_BIT8              _ATD0DR14.Overlap_STR.ATD0DR14HSTR.Bits.BIT8
    #define ATD0DR14H_BIT9              _ATD0DR14.Overlap_STR.ATD0DR14HSTR.Bits.BIT9
    #define ATD0DR14H_BIT10             _ATD0DR14.Overlap_STR.ATD0DR14HSTR.Bits.BIT10
    #define ATD0DR14H_BIT11             _ATD0DR14.Overlap_STR.ATD0DR14HSTR.Bits.BIT11
    #define ATD0DR14H_BIT12             _ATD0DR14.Overlap_STR.ATD0DR14HSTR.Bits.BIT12
    #define ATD0DR14H_BIT13             _ATD0DR14.Overlap_STR.ATD0DR14HSTR.Bits.BIT13
    #define ATD0DR14H_BIT14             _ATD0DR14.Overlap_STR.ATD0DR14HSTR.Bits.BIT14
    #define ATD0DR14H_BIT15             _ATD0DR14.Overlap_STR.ATD0DR14HSTR.Bits.BIT15
    
    #define ATD0DR14H_BIT8_MASK         1U
    #define ATD0DR14H_BIT9_MASK         2U
    #define ATD0DR14H_BIT10_MASK        4U
    #define ATD0DR14H_BIT11_MASK        8U
    #define ATD0DR14H_BIT12_MASK        16U
    #define ATD0DR14H_BIT13_MASK        32U
    #define ATD0DR14H_BIT14_MASK        64U
    #define ATD0DR14H_BIT15_MASK        128U
    

    /*** ATD0DR14L - ATD 0 Conversion Result Register 14 Low; 0x000002ED ***/
    union {
      byte Byte;
      struct {
        byte BIT0        :1;                                       /* Bit 0 */
        byte BIT1        :1;                                       /* Bit 1 */
        byte BIT2        :1;                                       /* Bit 2 */
        byte BIT3        :1;                                       /* Bit 3 */
        byte BIT4        :1;                                       /* Bit 4 */
        byte BIT5        :1;                                       /* Bit 5 */
        byte BIT6        :1;                                       /* Bit 6 */
        byte BIT7        :1;                                       /* Bit 7 */
      } Bits;
    } ATD0DR14LSTR;
    #define ATD0DR14L                   _ATD0DR14.Overlap_STR.ATD0DR14LSTR.Byte
    #define ATD0DR14L_BIT0              _ATD0DR14.Overlap_STR.ATD0DR14LSTR.Bits.BIT0
    #define ATD0DR14L_BIT1              _ATD0DR14.Overlap_STR.ATD0DR14LSTR.Bits.BIT1
    #define ATD0DR14L_BIT2              _ATD0DR14.Overlap_STR.ATD0DR14LSTR.Bits.BIT2
    #define ATD0DR14L_BIT3              _ATD0DR14.Overlap_STR.ATD0DR14LSTR.Bits.BIT3
    #define ATD0DR14L_BIT4              _ATD0DR14.Overlap_STR.ATD0DR14LSTR.Bits.BIT4
    #define ATD0DR14L_BIT5              _ATD0DR14.Overlap_STR.ATD0DR14LSTR.Bits.BIT5
    #define ATD0DR14L_BIT6              _ATD0DR14.Overlap_STR.ATD0DR14LSTR.Bits.BIT6
    #define ATD0DR14L_BIT7              _ATD0DR14.Overlap_STR.ATD0DR14LSTR.Bits.BIT7
    
    #define ATD0DR14L_BIT0_MASK         1U
    #define ATD0DR14L_BIT1_MASK         2U
    #define ATD0DR14L_BIT2_MASK         4U
    #define ATD0DR14L_BIT3_MASK         8U
    #define ATD0DR14L_BIT4_MASK         16U
    #define ATD0DR14L_BIT5_MASK         32U
    #define ATD0DR14L_BIT6_MASK         64U
    #define ATD0DR14L_BIT7_MASK         128U
    
  } Overlap_STR;

