frostfire45/Codewarrior/Lib/hc12c/include/mc9s12xeq384.h
  struct {
    word BIT0        :1;                                       /* Bit 0 */
    word BIT1        :1;                                       /* Bit 1 */
    word BIT2        :1;                                       /* Bit 2 */
    word BIT3        :1;                                       /* Bit 3 */
    word BIT4        :1;                                       /* Bit 4 */
    word BIT5        :1;                                       /* Bit 5 */
    word BIT6        :1;                                       /* Bit 6 */
    word BIT7        :1;                                       /* Bit 7 */
    word BIT8        :1;                                       /* Bit 8 */
    word BIT9        :1;                                       /* Bit 9 */
    word BIT10       :1;                                       /* Bit 10 */
    word BIT11       :1;                                       /* Bit 11 */
    word BIT12       :1;                                       /* Bit 12 */
    word BIT13       :1;                                       /* Bit 13 */
    word BIT14       :1;                                       /* Bit 14 */
    word BIT15       :1;                                       /* Bit 15 */
  } Bits;
} ATD0DR15STR;
extern volatile ATD0DR15STR _ATD0DR15 @(REG_BASE + 0x000002EEUL);
#define ATD0DR15                        _ATD0DR15.Word
#define ATD0DR15_BIT0                   _ATD0DR15.Bits.BIT0
#define ATD0DR15_BIT1                   _ATD0DR15.Bits.BIT1
#define ATD0DR15_BIT2                   _ATD0DR15.Bits.BIT2
#define ATD0DR15_BIT3                   _ATD0DR15.Bits.BIT3
#define ATD0DR15_BIT4                   _ATD0DR15.Bits.BIT4
#define ATD0DR15_BIT5                   _ATD0DR15.Bits.BIT5
#define ATD0DR15_BIT6                   _ATD0DR15.Bits.BIT6
#define ATD0DR15_BIT7                   _ATD0DR15.Bits.BIT7
#define ATD0DR15_BIT8                   _ATD0DR15.Bits.BIT8
#define ATD0DR15_BIT9                   _ATD0DR15.Bits.BIT9
#define ATD0DR15_BIT10                  _ATD0DR15.Bits.BIT10
#define ATD0DR15_BIT11                  _ATD0DR15.Bits.BIT11
#define ATD0DR15_BIT12                  _ATD0DR15.Bits.BIT12
#define ATD0DR15_BIT13                  _ATD0DR15.Bits.BIT13
#define ATD0DR15_BIT14                  _ATD0DR15.Bits.BIT14
#define ATD0DR15_BIT15                  _ATD0DR15.Bits.BIT15

#define ATD0DR15_BIT0_MASK              1U
#define ATD0DR15_BIT1_MASK              2U
#define ATD0DR15_BIT2_MASK              4U
#define ATD0DR15_BIT3_MASK              8U
#define ATD0DR15_BIT4_MASK              16U
#define ATD0DR15_BIT5_MASK              32U
#define ATD0DR15_BIT6_MASK              64U
#define ATD0DR15_BIT7_MASK              128U
#define ATD0DR15_BIT8_MASK              256U
#define ATD0DR15_BIT9_MASK              512U
#define ATD0DR15_BIT10_MASK             1024U
#define ATD0DR15_BIT11_MASK             2048U
#define ATD0DR15_BIT12_MASK             4096U
#define ATD0DR15_BIT13_MASK             8192U
#define ATD0DR15_BIT14_MASK             16384U
#define ATD0DR15_BIT15_MASK             32768U


/*** VREGHTCL - HT Control Register; 0x000002F0 ***/
typedef union {
  byte Byte;
  struct {
    byte HTIF        :1;                                       /* High Temperature Interrupt Flag */
    byte HTIE        :1;                                       /* High Temperature Interrupt Enable Bit */
    byte HTDS        :1;                                       /* High Temperature Detect Status Bi */
    byte HTEN        :1;                                       /* High Temperature Enable Bit */
    byte VAE         :1;                                       /* Voltage Access Enable Bit */
    byte VSEL        :1;                                       /* Voltage Access Select Bit */
    byte             :1; 
    byte             :1; 
  } Bits;
} VREGHTCLSTR;
extern volatile VREGHTCLSTR _VREGHTCL @(REG_BASE + 0x000002F0UL);
#define VREGHTCL                        _VREGHTCL.Byte
#define VREGHTCL_HTIF                   _VREGHTCL.Bits.HTIF
#define VREGHTCL_HTIE                   _VREGHTCL.Bits.HTIE
#define VREGHTCL_HTDS                   _VREGHTCL.Bits.HTDS
#define VREGHTCL_HTEN                   _VREGHTCL.Bits.HTEN
#define VREGHTCL_VAE                    _VREGHTCL.Bits.VAE
#define VREGHTCL_VSEL                   _VREGHTCL.Bits.VSEL

#define VREGHTCL_HTIF_MASK              1U
#define VREGHTCL_HTIE_MASK              2U
#define VREGHTCL_HTDS_MASK              4U
#define VREGHTCL_HTEN_MASK              8U
#define VREGHTCL_VAE_MASK               16U
#define VREGHTCL_VSEL_MASK              32U


/*** VREGCTRL - Control Register; 0x000002F1 ***/
typedef union {
  byte Byte;
  struct {
    byte LVIF        :1;                                       /* Low-Voltage Interrupt Flag */
    byte LVIE        :1;                                       /* Low-Voltage Interrupt Enable Bit */
    byte LVDS        :1;                                       /* Low-Voltage Detect Status Bit */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
} VREGCTRLSTR;
extern volatile VREGCTRLSTR _VREGCTRL @(REG_BASE + 0x000002F1UL);
#define VREGCTRL                        _VREGCTRL.Byte
#define VREGCTRL_LVIF                   _VREGCTRL.Bits.LVIF
#define VREGCTRL_LVIE                   _VREGCTRL.Bits.LVIE
#define VREGCTRL_LVDS                   _VREGCTRL.Bits.LVDS

#define VREGCTRL_LVIF_MASK              1U
#define VREGCTRL_LVIE_MASK              2U
#define VREGCTRL_LVDS_MASK              4U


/*** VREGAPICL - Autonomous Periodical Interrupt Control Register; 0x000002F2 ***/
typedef union {
  byte Byte;
  struct {
    byte APIF        :1;                                       /* Autonomous Periodical Interrupt Flag */
    byte APIE        :1;                                       /* Autonomous Periodical Interrupt Enable Bit */
    byte APIFE       :1;                                       /* Autonomous Periodical Interrupt Feature Enable Bit */
    byte APIEA       :1;                                       /* Autonomous Periodical Interrupt External Access Enable Bit */
    byte APIES       :1;                                       /* Autonomous Periodical Interrupt External Select Bit */
    byte             :1; 
    byte             :1; 
    byte APICLK      :1;                                       /* Autonomous Periodical Interrupt Clock Select Bit */
  } Bits;
} VREGAPICLSTR;
extern volatile VREGAPICLSTR _VREGAPICL @(REG_BASE + 0x000002F2UL);
#define VREGAPICL                       _VREGAPICL.Byte
#define VREGAPICL_APIF                  _VREGAPICL.Bits.APIF
#define VREGAPICL_APIE                  _VREGAPICL.Bits.APIE
#define VREGAPICL_APIFE                 _VREGAPICL.Bits.APIFE
#define VREGAPICL_APIEA                 _VREGAPICL.Bits.APIEA
#define VREGAPICL_APIES                 _VREGAPICL.Bits.APIES
#define VREGAPICL_APICLK                _VREGAPICL.Bits.APICLK

