frostfire45/Codewarrior/Lib/hc12c/include/mc9s12xeq384.h
#define ECT_TC2Hhi_BIT13_MASK            ECT_TC2Hhi_TC13_MASK
#define ECT_TC2Hhi_BIT14_MASK            ECT_TC2Hhi_TC14_MASK
#define ECT_TC2Hhi_BIT15_MASK            ECT_TC2Hhi_TC15_MASK
#define ECT_TC2Hlo_BIT0                  ECT_TC2Hlo_TC0
#define ECT_TC2Hlo_BIT1                  ECT_TC2Hlo_TC1
#define ECT_TC2Hlo_BIT2                  ECT_TC2Hlo_TC2
#define ECT_TC2Hlo_BIT3                  ECT_TC2Hlo_TC3
#define ECT_TC2Hlo_BIT4                  ECT_TC2Hlo_TC4
#define ECT_TC2Hlo_BIT5                  ECT_TC2Hlo_TC5
#define ECT_TC2Hlo_BIT6                  ECT_TC2Hlo_TC6
#define ECT_TC2Hlo_BIT7                  ECT_TC2Hlo_TC7
#define ECT_TC2Hlo_BIT0_MASK             ECT_TC2Hlo_TC0_MASK
#define ECT_TC2Hlo_BIT1_MASK             ECT_TC2Hlo_TC1_MASK
#define ECT_TC2Hlo_BIT2_MASK             ECT_TC2Hlo_TC2_MASK
#define ECT_TC2Hlo_BIT3_MASK             ECT_TC2Hlo_TC3_MASK
#define ECT_TC2Hlo_BIT4_MASK             ECT_TC2Hlo_TC4_MASK
#define ECT_TC2Hlo_BIT5_MASK             ECT_TC2Hlo_TC5_MASK
#define ECT_TC2Hlo_BIT6_MASK             ECT_TC2Hlo_TC6_MASK
#define ECT_TC2Hlo_BIT7_MASK             ECT_TC2Hlo_TC7_MASK
#define ECT_TC2H_BIT0                    ECT_TC2H_TC0
#define ECT_TC2H_BIT1                    ECT_TC2H_TC1
#define ECT_TC2H_BIT2                    ECT_TC2H_TC2
#define ECT_TC2H_BIT3                    ECT_TC2H_TC3
#define ECT_TC2H_BIT4                    ECT_TC2H_TC4
#define ECT_TC2H_BIT5                    ECT_TC2H_TC5
#define ECT_TC2H_BIT6                    ECT_TC2H_TC6
#define ECT_TC2H_BIT7                    ECT_TC2H_TC7
#define ECT_TC2H_BIT8                    ECT_TC2H_TC8
#define ECT_TC2H_BIT9                    ECT_TC2H_TC9
#define ECT_TC2H_BIT10                   ECT_TC2H_TC10
#define ECT_TC2H_BIT11                   ECT_TC2H_TC11
#define ECT_TC2H_BIT12                   ECT_TC2H_TC12
#define ECT_TC2H_BIT13                   ECT_TC2H_TC13
#define ECT_TC2H_BIT14                   ECT_TC2H_TC14
#define ECT_TC2H_BIT15                   ECT_TC2H_TC15
#define ECT_TC2H_BIT0_MASK               ECT_TC2H_TC0_MASK
#define ECT_TC2H_BIT1_MASK               ECT_TC2H_TC1_MASK
#define ECT_TC2H_BIT2_MASK               ECT_TC2H_TC2_MASK
#define ECT_TC2H_BIT3_MASK               ECT_TC2H_TC3_MASK
#define ECT_TC2H_BIT4_MASK               ECT_TC2H_TC4_MASK
#define ECT_TC2H_BIT5_MASK               ECT_TC2H_TC5_MASK
#define ECT_TC2H_BIT6_MASK               ECT_TC2H_TC6_MASK
#define ECT_TC2H_BIT7_MASK               ECT_TC2H_TC7_MASK
#define ECT_TC2H_BIT8_MASK               ECT_TC2H_TC8_MASK
#define ECT_TC2H_BIT9_MASK               ECT_TC2H_TC9_MASK
#define ECT_TC2H_BIT10_MASK              ECT_TC2H_TC10_MASK
#define ECT_TC2H_BIT11_MASK              ECT_TC2H_TC11_MASK
#define ECT_TC2H_BIT12_MASK              ECT_TC2H_TC12_MASK
#define ECT_TC2H_BIT13_MASK              ECT_TC2H_TC13_MASK
#define ECT_TC2H_BIT14_MASK              ECT_TC2H_TC14_MASK
#define ECT_TC2H_BIT15_MASK              ECT_TC2H_TC15_MASK
#define ECT_TC3Hhi_BIT8                  ECT_TC3Hhi_TC8
#define ECT_TC3Hhi_BIT9                  ECT_TC3Hhi_TC9
#define ECT_TC3Hhi_BIT10                 ECT_TC3Hhi_TC10
#define ECT_TC3Hhi_BIT11                 ECT_TC3Hhi_TC11
#define ECT_TC3Hhi_BIT12                 ECT_TC3Hhi_TC12
#define ECT_TC3Hhi_BIT13                 ECT_TC3Hhi_TC13
#define ECT_TC3Hhi_BIT14                 ECT_TC3Hhi_TC14
#define ECT_TC3Hhi_BIT15                 ECT_TC3Hhi_TC15
#define ECT_TC3Hhi_BIT8_MASK             ECT_TC3Hhi_TC8_MASK
#define ECT_TC3Hhi_BIT9_MASK             ECT_TC3Hhi_TC9_MASK
#define ECT_TC3Hhi_BIT10_MASK            ECT_TC3Hhi_TC10_MASK
#define ECT_TC3Hhi_BIT11_MASK            ECT_TC3Hhi_TC11_MASK
#define ECT_TC3Hhi_BIT12_MASK            ECT_TC3Hhi_TC12_MASK
#define ECT_TC3Hhi_BIT13_MASK            ECT_TC3Hhi_TC13_MASK
#define ECT_TC3Hhi_BIT14_MASK            ECT_TC3Hhi_TC14_MASK
#define ECT_TC3Hhi_BIT15_MASK            ECT_TC3Hhi_TC15_MASK
#define ECT_TC3Hlo_BIT0                  ECT_TC3Hlo_TC0
#define ECT_TC3Hlo_BIT1                  ECT_TC3Hlo_TC1
#define ECT_TC3Hlo_BIT2                  ECT_TC3Hlo_TC2
#define ECT_TC3Hlo_BIT3                  ECT_TC3Hlo_TC3
#define ECT_TC3Hlo_BIT4                  ECT_TC3Hlo_TC4
#define ECT_TC3Hlo_BIT5                  ECT_TC3Hlo_TC5
#define ECT_TC3Hlo_BIT6                  ECT_TC3Hlo_TC6
#define ECT_TC3Hlo_BIT7                  ECT_TC3Hlo_TC7
#define ECT_TC3Hlo_BIT0_MASK             ECT_TC3Hlo_TC0_MASK
#define ECT_TC3Hlo_BIT1_MASK             ECT_TC3Hlo_TC1_MASK
#define ECT_TC3Hlo_BIT2_MASK             ECT_TC3Hlo_TC2_MASK
#define ECT_TC3Hlo_BIT3_MASK             ECT_TC3Hlo_TC3_MASK
#define ECT_TC3Hlo_BIT4_MASK             ECT_TC3Hlo_TC4_MASK
#define ECT_TC3Hlo_BIT5_MASK             ECT_TC3Hlo_TC5_MASK
#define ECT_TC3Hlo_BIT6_MASK             ECT_TC3Hlo_TC6_MASK
#define ECT_TC3Hlo_BIT7_MASK             ECT_TC3Hlo_TC7_MASK
#define ECT_TC3H_BIT0                    ECT_TC3H_TC0
#define ECT_TC3H_BIT1                    ECT_TC3H_TC1
#define ECT_TC3H_BIT2                    ECT_TC3H_TC2
#define ECT_TC3H_BIT3                    ECT_TC3H_TC3
#define ECT_TC3H_BIT4                    ECT_TC3H_TC4
#define ECT_TC3H_BIT5                    ECT_TC3H_TC5
#define ECT_TC3H_BIT6                    ECT_TC3H_TC6
#define ECT_TC3H_BIT7                    ECT_TC3H_TC7
#define ECT_TC3H_BIT8                    ECT_TC3H_TC8
#define ECT_TC3H_BIT9                    ECT_TC3H_TC9
#define ECT_TC3H_BIT10                   ECT_TC3H_TC10
#define ECT_TC3H_BIT11                   ECT_TC3H_TC11
#define ECT_TC3H_BIT12                   ECT_TC3H_TC12
#define ECT_TC3H_BIT13                   ECT_TC3H_TC13
#define ECT_TC3H_BIT14                   ECT_TC3H_TC14
#define ECT_TC3H_BIT15                   ECT_TC3H_TC15
#define ECT_TC3H_BIT0_MASK               ECT_TC3H_TC0_MASK
#define ECT_TC3H_BIT1_MASK               ECT_TC3H_TC1_MASK
#define ECT_TC3H_BIT2_MASK               ECT_TC3H_TC2_MASK
#define ECT_TC3H_BIT3_MASK               ECT_TC3H_TC3_MASK
#define ECT_TC3H_BIT4_MASK               ECT_TC3H_TC4_MASK
#define ECT_TC3H_BIT5_MASK               ECT_TC3H_TC5_MASK
#define ECT_TC3H_BIT6_MASK               ECT_TC3H_TC6_MASK
#define ECT_TC3H_BIT7_MASK               ECT_TC3H_TC7_MASK
#define ECT_TC3H_BIT8_MASK               ECT_TC3H_TC8_MASK
#define ECT_TC3H_BIT9_MASK               ECT_TC3H_TC9_MASK
#define ECT_TC3H_BIT10_MASK              ECT_TC3H_TC10_MASK
#define ECT_TC3H_BIT11_MASK              ECT_TC3H_TC11_MASK
#define ECT_TC3H_BIT12_MASK              ECT_TC3H_TC12_MASK
#define ECT_TC3H_BIT13_MASK              ECT_TC3H_TC13_MASK
#define ECT_TC3H_BIT14_MASK              ECT_TC3H_TC14_MASK
#define ECT_TC3H_BIT15_MASK              ECT_TC3H_TC15_MASK
#define ATD1CTL2_ASCIF                   ATD1CTL2_ACMPIE
#define ATD1CTL2_ASCIF_MASK              ATD1CTL2_ACMPIE_MASK
#define ATD1CTL23_ASCIF                  ATD1CTL23_ACMPIE
#define ATD1CTL23_ASCIF_MASK             ATD1CTL23_ACMPIE_MASK
#define FCLKDIV_PRDIV8                   FCLKDIV_FDIV6
#define FCLKDIV_PRDIV8_MASK              FCLKDIV_FDIV6_MASK
#define PT0AD1_PT0AD116                  This_symb_has_been_depreciated
#define PT0AD1_PT0AD117                  This_symb_has_been_depreciated
#define PT0AD1_PT0AD118                  This_symb_has_been_depreciated
#define PT0AD1_PT0AD119                  This_symb_has_been_depreciated
#define PT0AD1_PT0AD120                  This_symb_has_been_depreciated
#define PT0AD1_PT0AD121                  This_symb_has_been_depreciated
#define PT0AD1_PT0AD122                  This_symb_has_been_depreciated
#define PT0AD1_PT0AD123                  This_symb_has_been_depreciated
#define PT0AD1_PT0AD116_MASK             This_symb_has_been_depreciated
#define PT0AD1_PT0AD117_MASK             This_symb_has_been_depreciated
#define PT0AD1_PT0AD118_MASK             This_symb_has_been_depreciated
#define PT0AD1_PT0AD119_MASK             This_symb_has_been_depreciated
#define PT0AD1_PT0AD120_MASK             This_symb_has_been_depreciated
#define PT0AD1_PT0AD121_MASK             This_symb_has_been_depreciated
#define PT0AD1_PT0AD122_MASK             This_symb_has_been_depreciated
#define PT0AD1_PT0AD123_MASK             This_symb_has_been_depreciated
#define PT1AD1_PT1AD18                   PT1AD1_PT1AD10
#define PT1AD1_PT1AD19                   PT1AD1_PT1AD11
#define PT1AD1_PT1AD110                  PT1AD1_PT1AD12
#define PT1AD1_PT1AD111                  PT1AD1_PT1AD13
#define PT1AD1_PT1AD112                  PT1AD1_PT1AD14
#define PT1AD1_PT1AD113                  PT1AD1_PT1AD15
#define PT1AD1_PT1AD114                  PT1AD1_PT1AD16
#define PT1AD1_PT1AD115                  PT1AD1_PT1AD17
#define PT1AD1_PT1AD_18                  This_symb_has_been_depreciated
#define PT1AD1_PT1AD1_10                 This_symb_has_been_depreciated
#define PT1AD1_PT1AD                     This_symb_has_been_depreciated
#define PT1AD1_PT1AD18_MASK              PT1AD1_PT1AD10_MASK
#define PT1AD1_PT1AD19_MASK              PT1AD1_PT1AD11_MASK
#define PT1AD1_PT1AD110_MASK             PT1AD1_PT1AD12_MASK
#define PT1AD1_PT1AD111_MASK             PT1AD1_PT1AD13_MASK
#define PT1AD1_PT1AD112_MASK             PT1AD1_PT1AD14_MASK
#define PT1AD1_PT1AD113_MASK             PT1AD1_PT1AD15_MASK
#define PT1AD1_PT1AD114_MASK             PT1AD1_PT1AD16_MASK
#define PT1AD1_PT1AD115_MASK             PT1AD1_PT1AD17_MASK
#define PT1AD1_PT1AD_18_MASK             This_symb_has_been_depreciated
#define PT1AD1_PT1AD_18_BITNUM           This_symb_has_been_depreciated
#define PT1AD1_PT1AD1_10_MASK            This_symb_has_been_depreciated
#define PT1AD1_PT1AD1_10_BITNUM          This_symb_has_been_depreciated
#define PT01AD1_PT1AD18                  This_symb_has_been_depreciated
#define PT01AD1_PT1AD19                  This_symb_has_been_depreciated
#define PT01AD1_PT1AD110                 This_symb_has_been_depreciated
#define PT01AD1_PT1AD111                 This_symb_has_been_depreciated
#define PT01AD1_PT1AD112                 This_symb_has_been_depreciated
#define PT01AD1_PT1AD113                 This_symb_has_been_depreciated
#define PT01AD1_PT1AD114                 This_symb_has_been_depreciated
#define PT01AD1_PT1AD115                 This_symb_has_been_depreciated
#define PT01AD1_PT0AD116                 This_symb_has_been_depreciated
#define PT01AD1_PT0AD117                 This_symb_has_been_depreciated
#define PT01AD1_PT0AD118                 This_symb_has_been_depreciated
#define PT01AD1_PT0AD119                 This_symb_has_been_depreciated
#define PT01AD1_PT0AD120                 This_symb_has_been_depreciated
#define PT01AD1_PT0AD121                 This_symb_has_been_depreciated
#define PT01AD1_PT0AD122                 This_symb_has_been_depreciated
#define PT01AD1_PT0AD123                 This_symb_has_been_depreciated
#define PT01AD1_PT1AD_18                 This_symb_has_been_depreciated
#define PT01AD1_PT1AD1_10                This_symb_has_been_depreciated
#define PT01AD1_PT0AD1_16                This_symb_has_been_depreciated
#define PT01AD1_PT1AD1                   This_symb_has_been_depreciated
#define PT01AD1_PT0AD1                   This_symb_has_been_depreciated
#define PT01AD1_PT1AD18_MASK             This_symb_has_been_depreciated
#define PT01AD1_PT1AD19_MASK             This_symb_has_been_depreciated
#define PT01AD1_PT1AD110_MASK            This_symb_has_been_depreciated
#define PT01AD1_PT1AD111_MASK            This_symb_has_been_depreciated
#define PT01AD1_PT1AD112_MASK            This_symb_has_been_depreciated
#define PT01AD1_PT1AD113_MASK            This_symb_has_been_depreciated
#define PT01AD1_PT1AD114_MASK            This_symb_has_been_depreciated
#define PT01AD1_PT1AD115_MASK            This_symb_has_been_depreciated
#define PT01AD1_PT0AD116_MASK            This_symb_has_been_depreciated
#define PT01AD1_PT0AD117_MASK            This_symb_has_been_depreciated
#define PT01AD1_PT0AD118_MASK            This_symb_has_been_depreciated
#define PT01AD1_PT0AD119_MASK            This_symb_has_been_depreciated
#define PT01AD1_PT0AD120_MASK            This_symb_has_been_depreciated
#define PT01AD1_PT0AD121_MASK            This_symb_has_been_depreciated
#define PT01AD1_PT0AD122_MASK            This_symb_has_been_depreciated
#define PT01AD1_PT0AD123_MASK            This_symb_has_been_depreciated
#define PT01AD1_PT1AD_18_MASK            This_symb_has_been_depreciated
#define PT01AD1_PT1AD_18_BITNUM          This_symb_has_been_depreciated
#define PT01AD1_PT1AD1_10_MASK           This_symb_has_been_depreciated
#define PT01AD1_PT1AD1_10_BITNUM         This_symb_has_been_depreciated
#define PT01AD1_PT0AD1_16_MASK           This_symb_has_been_depreciated
#define PT01AD1_PT0AD1_16_BITNUM         This_symb_has_been_depreciated
#define DDR0AD1_DDR0AD116                This_symb_has_been_depreciated
#define DDR0AD1_DDR0AD117                This_symb_has_been_depreciated
#define DDR0AD1_DDR0AD118                This_symb_has_been_depreciated
#define DDR0AD1_DDR0AD119                This_symb_has_been_depreciated
#define DDR0AD1_DDR0AD120                This_symb_has_been_depreciated
#define DDR0AD1_DDR0AD121                This_symb_has_been_depreciated
#define DDR0AD1_DDR0AD122                This_symb_has_been_depreciated
#define DDR0AD1_DDR0AD123                This_symb_has_been_depreciated
#define DDR0AD1_DDR0AD116_MASK           This_symb_has_been_depreciated
#define DDR0AD1_DDR0AD117_MASK           This_symb_has_been_depreciated
#define DDR0AD1_DDR0AD118_MASK           This_symb_has_been_depreciated
#define DDR0AD1_DDR0AD119_MASK           This_symb_has_been_depreciated
#define DDR0AD1_DDR0AD120_MASK           This_symb_has_been_depreciated
#define DDR0AD1_DDR0AD121_MASK           This_symb_has_been_depreciated
#define DDR0AD1_DDR0AD122_MASK           This_symb_has_been_depreciated
#define DDR0AD1_DDR0AD123_MASK           This_symb_has_been_depreciated
#define DDR1AD1_DDR1AD18                 DDR1AD1_DDR1AD10
#define DDR1AD1_DDR1AD19                 DDR1AD1_DDR1AD11
#define DDR1AD1_DDR1AD110                DDR1AD1_DDR1AD12
#define DDR1AD1_DDR1AD111                DDR1AD1_DDR1AD13
#define DDR1AD1_DDR1AD112                DDR1AD1_DDR1AD14
#define DDR1AD1_DDR1AD113                DDR1AD1_DDR1AD15
#define DDR1AD1_DDR1AD114                DDR1AD1_DDR1AD16
#define DDR1AD1_DDR1AD115                DDR1AD1_DDR1AD17
#define DDR1AD1_DDR1AD_18                This_symb_has_been_depreciated
#define DDR1AD1_DDR1AD1_10               This_symb_has_been_depreciated
#define DDR1AD1_DDR1AD                   This_symb_has_been_depreciated
#define DDR1AD1_DDR1AD18_MASK            DDR1AD1_DDR1AD10_MASK
#define DDR1AD1_DDR1AD19_MASK            DDR1AD1_DDR1AD11_MASK
#define DDR1AD1_DDR1AD110_MASK           DDR1AD1_DDR1AD12_MASK
#define DDR1AD1_DDR1AD111_MASK           DDR1AD1_DDR1AD13_MASK
#define DDR1AD1_DDR1AD112_MASK           DDR1AD1_DDR1AD14_MASK
#define DDR1AD1_DDR1AD113_MASK           DDR1AD1_DDR1AD15_MASK
#define DDR1AD1_DDR1AD114_MASK           DDR1AD1_DDR1AD16_MASK
#define DDR1AD1_DDR1AD115_MASK           DDR1AD1_DDR1AD17_MASK
#define DDR1AD1_DDR1AD_18_MASK           This_symb_has_been_depreciated
#define DDR1AD1_DDR1AD_18_BITNUM         This_symb_has_been_depreciated
#define DDR1AD1_DDR1AD1_10_MASK          This_symb_has_been_depreciated
#define DDR1AD1_DDR1AD1_10_BITNUM        This_symb_has_been_depreciated
#define DDR01AD1_DDR1AD18                This_symb_has_been_depreciated
#define DDR01AD1_DDR1AD19                This_symb_has_been_depreciated
#define DDR01AD1_DDR1AD110               This_symb_has_been_depreciated
#define DDR01AD1_DDR1AD111               This_symb_has_been_depreciated
#define DDR01AD1_DDR1AD112               This_symb_has_been_depreciated
#define DDR01AD1_DDR1AD113               This_symb_has_been_depreciated
#define DDR01AD1_DDR1AD114               This_symb_has_been_depreciated
#define DDR01AD1_DDR1AD115               This_symb_has_been_depreciated
#define DDR01AD1_DDR0AD116               This_symb_has_been_depreciated
#define DDR01AD1_DDR0AD117               This_symb_has_been_depreciated
#define DDR01AD1_DDR0AD118               This_symb_has_been_depreciated
#define DDR01AD1_DDR0AD119               This_symb_has_been_depreciated
#define DDR01AD1_DDR0AD120               This_symb_has_been_depreciated
#define DDR01AD1_DDR0AD121               This_symb_has_been_depreciated
#define DDR01AD1_DDR0AD122               This_symb_has_been_depreciated
#define DDR01AD1_DDR0AD123               This_symb_has_been_depreciated
#define DDR01AD1_DDR1AD_18               This_symb_has_been_depreciated
#define DDR01AD1_DDR1AD1_10              This_symb_has_been_depreciated
#define DDR01AD1_DDR0AD1_16              This_symb_has_been_depreciated
#define DDR01AD1_DDR1AD1                 This_symb_has_been_depreciated
#define DDR01AD1_DDR0AD1                 This_symb_has_been_depreciated
#define DDR01AD1_DDR1AD18_MASK           This_symb_has_been_depreciated
#define DDR01AD1_DDR1AD19_MASK           This_symb_has_been_depreciated
#define DDR01AD1_DDR1AD110_MASK          This_symb_has_been_depreciated
#define DDR01AD1_DDR1AD111_MASK          This_symb_has_been_depreciated
#define DDR01AD1_DDR1AD112_MASK          This_symb_has_been_depreciated
#define DDR01AD1_DDR1AD113_MASK          This_symb_has_been_depreciated
#define DDR01AD1_DDR1AD114_MASK          This_symb_has_been_depreciated
#define DDR01AD1_DDR1AD115_MASK          This_symb_has_been_depreciated
#define DDR01AD1_DDR0AD116_MASK          This_symb_has_been_depreciated
#define DDR01AD1_DDR0AD117_MASK          This_symb_has_been_depreciated
#define DDR01AD1_DDR0AD118_MASK          This_symb_has_been_depreciated
#define DDR01AD1_DDR0AD119_MASK          This_symb_has_been_depreciated
#define DDR01AD1_DDR0AD120_MASK          This_symb_has_been_depreciated
#define DDR01AD1_DDR0AD121_MASK          This_symb_has_been_depreciated
#define DDR01AD1_DDR0AD122_MASK          This_symb_has_been_depreciated
#define DDR01AD1_DDR0AD123_MASK          This_symb_has_been_depreciated
#define DDR01AD1_DDR1AD_18_MASK          This_symb_has_been_depreciated
#define DDR01AD1_DDR1AD_18_BITNUM        This_symb_has_been_depreciated
#define DDR01AD1_DDR1AD1_10_MASK         This_symb_has_been_depreciated
#define DDR01AD1_DDR1AD1_10_BITNUM       This_symb_has_been_depreciated
#define DDR01AD1_DDR0AD1_16_MASK         This_symb_has_been_depreciated
#define DDR01AD1_DDR0AD1_16_BITNUM       This_symb_has_been_depreciated
#define RDR0AD1_RDR0AD116                This_symb_has_been_depreciated
#define RDR0AD1_RDR0AD117                This_symb_has_been_depreciated
#define RDR0AD1_RDR0AD118                This_symb_has_been_depreciated
#define RDR0AD1_RDR0AD119                This_symb_has_been_depreciated
#define RDR0AD1_RDR0AD120                This_symb_has_been_depreciated
#define RDR0AD1_RDR0AD121                This_symb_has_been_depreciated
#define RDR0AD1_RDR0AD122                This_symb_has_been_depreciated
#define RDR0AD1_RDR0AD123                This_symb_has_been_depreciated
#define RDR0AD1_RDR0AD116_MASK           This_symb_has_been_depreciated
#define RDR0AD1_RDR0AD117_MASK           This_symb_has_been_depreciated
#define RDR0AD1_RDR0AD118_MASK           This_symb_has_been_depreciated
#define RDR0AD1_RDR0AD119_MASK           This_symb_has_been_depreciated
#define RDR0AD1_RDR0AD120_MASK           This_symb_has_been_depreciated
#define RDR0AD1_RDR0AD121_MASK           This_symb_has_been_depreciated
#define RDR0AD1_RDR0AD122_MASK           This_symb_has_been_depreciated
#define RDR0AD1_RDR0AD123_MASK           This_symb_has_been_depreciated
#define RDR1AD1_RDR1AD18                 RDR1AD1_RDR1AD10
#define RDR1AD1_RDR1AD19                 RDR1AD1_RDR1AD11
#define RDR1AD1_RDR1AD110                RDR1AD1_RDR1AD12
#define RDR1AD1_RDR1AD111                RDR1AD1_RDR1AD13
#define RDR1AD1_RDR1AD112                RDR1AD1_RDR1AD14
#define RDR1AD1_RDR1AD113                RDR1AD1_RDR1AD15
#define RDR1AD1_RDR1AD114                RDR1AD1_RDR1AD16
#define RDR1AD1_RDR1AD115                RDR1AD1_RDR1AD17
#define RDR1AD1_RDR1AD_18                This_symb_has_been_depreciated
#define RDR1AD1_RDR1AD1_10               This_symb_has_been_depreciated
#define RDR1AD1_RDR1AD                   This_symb_has_been_depreciated
#define RDR1AD1_RDR1AD18_MASK            RDR1AD1_RDR1AD10_MASK
#define RDR1AD1_RDR1AD19_MASK            RDR1AD1_RDR1AD11_MASK
#define RDR1AD1_RDR1AD110_MASK           RDR1AD1_RDR1AD12_MASK
#define RDR1AD1_RDR1AD111_MASK           RDR1AD1_RDR1AD13_MASK
#define RDR1AD1_RDR1AD112_MASK           RDR1AD1_RDR1AD14_MASK
#define RDR1AD1_RDR1AD113_MASK           RDR1AD1_RDR1AD15_MASK
#define RDR1AD1_RDR1AD114_MASK           RDR1AD1_RDR1AD16_MASK
#define RDR1AD1_RDR1AD115_MASK           RDR1AD1_RDR1AD17_MASK
#define RDR1AD1_RDR1AD_18_MASK           This_symb_has_been_depreciated
#define RDR1AD1_RDR1AD_18_BITNUM         This_symb_has_been_depreciated
#define RDR1AD1_RDR1AD1_10_MASK          This_symb_has_been_depreciated
#define RDR1AD1_RDR1AD1_10_BITNUM        This_symb_has_been_depreciated
#define RDR01AD1_RDR1AD18                This_symb_has_been_depreciated
#define RDR01AD1_RDR1AD19                This_symb_has_been_depreciated
#define RDR01AD1_RDR1AD110               This_symb_has_been_depreciated
#define RDR01AD1_RDR1AD111               This_symb_has_been_depreciated
#define RDR01AD1_RDR1AD112               This_symb_has_been_depreciated
#define RDR01AD1_RDR1AD113               This_symb_has_been_depreciated
#define RDR01AD1_RDR1AD114               This_symb_has_been_depreciated
#define RDR01AD1_RDR1AD115               This_symb_has_been_depreciated
#define RDR01AD1_RDR0AD116               This_symb_has_been_depreciated
#define RDR01AD1_RDR0AD117               This_symb_has_been_depreciated
#define RDR01AD1_RDR0AD118               This_symb_has_been_depreciated
#define RDR01AD1_RDR0AD119               This_symb_has_been_depreciated
#define RDR01AD1_RDR0AD120               This_symb_has_been_depreciated
#define RDR01AD1_RDR0AD121               This_symb_has_been_depreciated
#define RDR01AD1_RDR0AD122               This_symb_has_been_depreciated
#define RDR01AD1_RDR0AD123               This_symb_has_been_depreciated
#define RDR01AD1_RDR1AD_18               This_symb_has_been_depreciated
#define RDR01AD1_RDR1AD1_10              This_symb_has_been_depreciated
#define RDR01AD1_RDR0AD1_16              This_symb_has_been_depreciated
#define RDR01AD1_RDR1AD1                 This_symb_has_been_depreciated
#define RDR01AD1_RDR0AD1                 This_symb_has_been_depreciated
#define RDR01AD1_RDR1AD18_MASK           This_symb_has_been_depreciated
#define RDR01AD1_RDR1AD19_MASK           This_symb_has_been_depreciated
#define RDR01AD1_RDR1AD110_MASK          This_symb_has_been_depreciated
#define RDR01AD1_RDR1AD111_MASK          This_symb_has_been_depreciated
#define RDR01AD1_RDR1AD112_MASK          This_symb_has_been_depreciated
#define RDR01AD1_RDR1AD113_MASK          This_symb_has_been_depreciated
#define RDR01AD1_RDR1AD114_MASK          This_symb_has_been_depreciated
#define RDR01AD1_RDR1AD115_MASK          This_symb_has_been_depreciated
#define RDR01AD1_RDR0AD116_MASK          This_symb_has_been_depreciated
#define RDR01AD1_RDR0AD117_MASK          This_symb_has_been_depreciated
#define RDR01AD1_RDR0AD118_MASK          This_symb_has_been_depreciated
#define RDR01AD1_RDR0AD119_MASK          This_symb_has_been_depreciated
#define RDR01AD1_RDR0AD120_MASK          This_symb_has_been_depreciated
#define RDR01AD1_RDR0AD121_MASK          This_symb_has_been_depreciated
#define RDR01AD1_RDR0AD122_MASK          This_symb_has_been_depreciated
#define RDR01AD1_RDR0AD123_MASK          This_symb_has_been_depreciated
#define RDR01AD1_RDR1AD_18_MASK          This_symb_has_been_depreciated
#define RDR01AD1_RDR1AD_18_BITNUM        This_symb_has_been_depreciated
#define RDR01AD1_RDR1AD1_10_MASK         This_symb_has_been_depreciated
#define RDR01AD1_RDR1AD1_10_BITNUM       This_symb_has_been_depreciated
