frostfire45/Codewarrior/Lib/hc12c/include/mc9s12xeq384.h
#define ECT_TC1H_TC7_MASK                This_symb_has_been_depreciated
#define ECT_TC1H_TC8_MASK                This_symb_has_been_depreciated
#define ECT_TC1H_TC9_MASK                This_symb_has_been_depreciated
#define ECT_TC1H_TC10_MASK               This_symb_has_been_depreciated
#define ECT_TC1H_TC11_MASK               This_symb_has_been_depreciated
#define ECT_TC1H_TC12_MASK               This_symb_has_been_depreciated
#define ECT_TC1H_TC13_MASK               This_symb_has_been_depreciated
#define ECT_TC1H_TC14_MASK               This_symb_has_been_depreciated
#define ECT_TC1H_TC15_MASK               This_symb_has_been_depreciated
#define ECT_TC2Hhi_TC8                   This_symb_has_been_depreciated
#define ECT_TC2Hhi_TC9                   This_symb_has_been_depreciated
#define ECT_TC2Hhi_TC10                  This_symb_has_been_depreciated
#define ECT_TC2Hhi_TC11                  This_symb_has_been_depreciated
#define ECT_TC2Hhi_TC12                  This_symb_has_been_depreciated
#define ECT_TC2Hhi_TC13                  This_symb_has_been_depreciated
#define ECT_TC2Hhi_TC14                  This_symb_has_been_depreciated
#define ECT_TC2Hhi_TC15                  This_symb_has_been_depreciated
#define ECT_TC2Hhi_TC8_MASK              This_symb_has_been_depreciated
#define ECT_TC2Hhi_TC9_MASK              This_symb_has_been_depreciated
#define ECT_TC2Hhi_TC10_MASK             This_symb_has_been_depreciated
#define ECT_TC2Hhi_TC11_MASK             This_symb_has_been_depreciated
#define ECT_TC2Hhi_TC12_MASK             This_symb_has_been_depreciated
#define ECT_TC2Hhi_TC13_MASK             This_symb_has_been_depreciated
#define ECT_TC2Hhi_TC14_MASK             This_symb_has_been_depreciated
#define ECT_TC2Hhi_TC15_MASK             This_symb_has_been_depreciated
#define ECT_TC2Hlo_TC0                   This_symb_has_been_depreciated
#define ECT_TC2Hlo_TC1                   This_symb_has_been_depreciated
#define ECT_TC2Hlo_TC2                   This_symb_has_been_depreciated
#define ECT_TC2Hlo_TC3                   This_symb_has_been_depreciated
#define ECT_TC2Hlo_TC4                   This_symb_has_been_depreciated
#define ECT_TC2Hlo_TC5                   This_symb_has_been_depreciated
#define ECT_TC2Hlo_TC6                   This_symb_has_been_depreciated
#define ECT_TC2Hlo_TC7                   This_symb_has_been_depreciated
#define ECT_TC2Hlo_TC0_MASK              This_symb_has_been_depreciated
#define ECT_TC2Hlo_TC1_MASK              This_symb_has_been_depreciated
#define ECT_TC2Hlo_TC2_MASK              This_symb_has_been_depreciated
#define ECT_TC2Hlo_TC3_MASK              This_symb_has_been_depreciated
#define ECT_TC2Hlo_TC4_MASK              This_symb_has_been_depreciated
#define ECT_TC2Hlo_TC5_MASK              This_symb_has_been_depreciated
#define ECT_TC2Hlo_TC6_MASK              This_symb_has_been_depreciated
#define ECT_TC2Hlo_TC7_MASK              This_symb_has_been_depreciated
#define ECT_TC2H_TC0                     This_symb_has_been_depreciated
#define ECT_TC2H_TC1                     This_symb_has_been_depreciated
#define ECT_TC2H_TC2                     This_symb_has_been_depreciated
#define ECT_TC2H_TC3                     This_symb_has_been_depreciated
#define ECT_TC2H_TC4                     This_symb_has_been_depreciated
#define ECT_TC2H_TC5                     This_symb_has_been_depreciated
#define ECT_TC2H_TC6                     This_symb_has_been_depreciated
#define ECT_TC2H_TC7                     This_symb_has_been_depreciated
#define ECT_TC2H_TC8                     This_symb_has_been_depreciated
#define ECT_TC2H_TC9                     This_symb_has_been_depreciated
#define ECT_TC2H_TC10                    This_symb_has_been_depreciated
#define ECT_TC2H_TC11                    This_symb_has_been_depreciated
#define ECT_TC2H_TC12                    This_symb_has_been_depreciated
#define ECT_TC2H_TC13                    This_symb_has_been_depreciated
#define ECT_TC2H_TC14                    This_symb_has_been_depreciated
#define ECT_TC2H_TC15                    This_symb_has_been_depreciated
#define ECT_TC2H_TC0_MASK                This_symb_has_been_depreciated
#define ECT_TC2H_TC1_MASK                This_symb_has_been_depreciated
#define ECT_TC2H_TC2_MASK                This_symb_has_been_depreciated
#define ECT_TC2H_TC3_MASK                This_symb_has_been_depreciated
#define ECT_TC2H_TC4_MASK                This_symb_has_been_depreciated
#define ECT_TC2H_TC5_MASK                This_symb_has_been_depreciated
#define ECT_TC2H_TC6_MASK                This_symb_has_been_depreciated
#define ECT_TC2H_TC7_MASK                This_symb_has_been_depreciated
#define ECT_TC2H_TC8_MASK                This_symb_has_been_depreciated
#define ECT_TC2H_TC9_MASK                This_symb_has_been_depreciated
#define ECT_TC2H_TC10_MASK               This_symb_has_been_depreciated
#define ECT_TC2H_TC11_MASK               This_symb_has_been_depreciated
#define ECT_TC2H_TC12_MASK               This_symb_has_been_depreciated
#define ECT_TC2H_TC13_MASK               This_symb_has_been_depreciated
#define ECT_TC2H_TC14_MASK               This_symb_has_been_depreciated
#define ECT_TC2H_TC15_MASK               This_symb_has_been_depreciated
#define ECT_TC3Hhi_TC8                   This_symb_has_been_depreciated
#define ECT_TC3Hhi_TC9                   This_symb_has_been_depreciated
#define ECT_TC3Hhi_TC10                  This_symb_has_been_depreciated
#define ECT_TC3Hhi_TC11                  This_symb_has_been_depreciated
#define ECT_TC3Hhi_TC12                  This_symb_has_been_depreciated
#define ECT_TC3Hhi_TC13                  This_symb_has_been_depreciated
#define ECT_TC3Hhi_TC14                  This_symb_has_been_depreciated
#define ECT_TC3Hhi_TC15                  This_symb_has_been_depreciated
#define ECT_TC3Hhi_TC8_MASK              This_symb_has_been_depreciated
#define ECT_TC3Hhi_TC9_MASK              This_symb_has_been_depreciated
#define ECT_TC3Hhi_TC10_MASK             This_symb_has_been_depreciated
#define ECT_TC3Hhi_TC11_MASK             This_symb_has_been_depreciated
#define ECT_TC3Hhi_TC12_MASK             This_symb_has_been_depreciated
#define ECT_TC3Hhi_TC13_MASK             This_symb_has_been_depreciated
#define ECT_TC3Hhi_TC14_MASK             This_symb_has_been_depreciated
#define ECT_TC3Hhi_TC15_MASK             This_symb_has_been_depreciated
#define ECT_TC3Hlo_TC0                   This_symb_has_been_depreciated
#define ECT_TC3Hlo_TC1                   This_symb_has_been_depreciated
#define ECT_TC3Hlo_TC2                   This_symb_has_been_depreciated
#define ECT_TC3Hlo_TC3                   This_symb_has_been_depreciated
#define ECT_TC3Hlo_TC4                   This_symb_has_been_depreciated
#define ECT_TC3Hlo_TC5                   This_symb_has_been_depreciated
#define ECT_TC3Hlo_TC6                   This_symb_has_been_depreciated
#define ECT_TC3Hlo_TC7                   This_symb_has_been_depreciated
#define ECT_TC3Hlo_TC0_MASK              This_symb_has_been_depreciated
#define ECT_TC3Hlo_TC1_MASK              This_symb_has_been_depreciated
#define ECT_TC3Hlo_TC2_MASK              This_symb_has_been_depreciated
#define ECT_TC3Hlo_TC3_MASK              This_symb_has_been_depreciated
#define ECT_TC3Hlo_TC4_MASK              This_symb_has_been_depreciated
#define ECT_TC3Hlo_TC5_MASK              This_symb_has_been_depreciated
#define ECT_TC3Hlo_TC6_MASK              This_symb_has_been_depreciated
#define ECT_TC3Hlo_TC7_MASK              This_symb_has_been_depreciated
#define ECT_TC3H_TC0                     This_symb_has_been_depreciated
#define ECT_TC3H_TC1                     This_symb_has_been_depreciated
#define ECT_TC3H_TC2                     This_symb_has_been_depreciated
#define ECT_TC3H_TC3                     This_symb_has_been_depreciated
#define ECT_TC3H_TC4                     This_symb_has_been_depreciated
#define ECT_TC3H_TC5                     This_symb_has_been_depreciated
#define ECT_TC3H_TC6                     This_symb_has_been_depreciated
#define ECT_TC3H_TC7                     This_symb_has_been_depreciated
#define ECT_TC3H_TC8                     This_symb_has_been_depreciated
#define ECT_TC3H_TC9                     This_symb_has_been_depreciated
#define ECT_TC3H_TC10                    This_symb_has_been_depreciated
#define ECT_TC3H_TC11                    This_symb_has_been_depreciated
#define ECT_TC3H_TC12                    This_symb_has_been_depreciated
#define ECT_TC3H_TC13                    This_symb_has_been_depreciated
#define ECT_TC3H_TC14                    This_symb_has_been_depreciated
#define ECT_TC3H_TC15                    This_symb_has_been_depreciated
#define ECT_TC3H_TC0_MASK                This_symb_has_been_depreciated
#define ECT_TC3H_TC1_MASK                This_symb_has_been_depreciated
#define ECT_TC3H_TC2_MASK                This_symb_has_been_depreciated
#define ECT_TC3H_TC3_MASK                This_symb_has_been_depreciated
#define ECT_TC3H_TC4_MASK                This_symb_has_been_depreciated
#define ECT_TC3H_TC5_MASK                This_symb_has_been_depreciated
#define ECT_TC3H_TC6_MASK                This_symb_has_been_depreciated
#define ECT_TC3H_TC7_MASK                This_symb_has_been_depreciated
#define ECT_TC3H_TC8_MASK                This_symb_has_been_depreciated
#define ECT_TC3H_TC9_MASK                This_symb_has_been_depreciated
#define ECT_TC3H_TC10_MASK               This_symb_has_been_depreciated
#define ECT_TC3H_TC11_MASK               This_symb_has_been_depreciated
#define ECT_TC3H_TC12_MASK               This_symb_has_been_depreciated
#define ECT_TC3H_TC13_MASK               This_symb_has_been_depreciated
#define ECT_TC3H_TC14_MASK               This_symb_has_been_depreciated
#define ECT_TC3H_TC15_MASK               This_symb_has_been_depreciated
#define ATD1CTL2_AWAI                    ATD1CTL2_ICLKSTP
#define ATD1CTL2_AWAI_MASK               ATD1CTL2_ICLKSTP_MASK
#define ATD1CTL23_AWAI                   ATD1CTL23_ICLKSTP
#define ATD1CTL23_AWAI_MASK              ATD1CTL23_ICLKSTP_MASK
#define IIC0_IBCR2_AD8                   IIC0_IBCR2_ADR0
#define IIC0_IBCR2_AD9                   IIC0_IBCR2_ADR1
#define IIC0_IBCR2_AD10                  IIC0_IBCR2_ADR2
#define IIC0_IBCR2_AD_8                  IIC0_IBCR2_ADR
#define IIC0_IBCR2_AD                    This_symb_has_been_depreciated
#define IIC0_IBCR2_AD8_MASK              IIC0_IBCR2_ADR0_MASK
#define IIC0_IBCR2_AD9_MASK              IIC0_IBCR2_ADR1_MASK
#define IIC0_IBCR2_AD10_MASK             IIC0_IBCR2_ADR2_MASK
#define IIC0_IBCR2_AD_8_MASK             IIC0_IBCR2_ADR_MASK
#define IIC0_IBCR2_AD_8_BITNUM           IIC0_IBCR2_ADR_BITNUM
#define FERCNFG_EACCEIE                  This_symb_has_been_depreciated
#define FERCNFG_EACCEIE_MASK             This_symb_has_been_depreciated
#define CAN0RIDR0                        CAN0RXIDR0
#define CAN0RIDR0_ID21                   CAN0RXIDR0_ID21
#define CAN0RIDR0_ID22                   CAN0RXIDR0_ID22
#define CAN0RIDR0_ID23                   CAN0RXIDR0_ID23
#define CAN0RIDR0_ID24                   CAN0RXIDR0_ID24
#define CAN0RIDR0_ID25                   CAN0RXIDR0_ID25
#define CAN0RIDR0_ID26                   CAN0RXIDR0_ID26
#define CAN0RIDR0_ID27                   CAN0RXIDR0_ID27
#define CAN0RIDR0_ID28                   CAN0RXIDR0_ID28
#define CAN0RIDR_ARR                     CAN0RXIDR_ARR
#define CAN0RIDR0_ID21_MASK              CAN0RXIDR0_ID21_MASK
#define CAN0RIDR0_ID22_MASK              CAN0RXIDR0_ID22_MASK
#define CAN0RIDR0_ID23_MASK              CAN0RXIDR0_ID23_MASK
#define CAN0RIDR0_ID24_MASK              CAN0RXIDR0_ID24_MASK
#define CAN0RIDR0_ID25_MASK              CAN0RXIDR0_ID25_MASK
#define CAN0RIDR0_ID26_MASK              CAN0RXIDR0_ID26_MASK
#define CAN0RIDR0_ID27_MASK              CAN0RXIDR0_ID27_MASK
#define CAN0RIDR0_ID28_MASK              CAN0RXIDR0_ID28_MASK
#define CAN0RIDR1                        CAN0RXIDR1
#define CAN0RIDR1_ID15                   CAN0RXIDR1_ID15
#define CAN0RIDR1_ID16                   CAN0RXIDR1_ID16
#define CAN0RIDR1_ID17                   CAN0RXIDR1_ID17
#define CAN0RIDR1_IDE                    CAN0RXIDR1_IDE
#define CAN0RIDR1_SRR                    CAN0RXIDR1_SRR
#define CAN0RIDR1_ID18                   CAN0RXIDR1_ID18
#define CAN0RIDR1_ID19                   CAN0RXIDR1_ID19
#define CAN0RIDR1_ID20                   CAN0RXIDR1_ID20
#define CAN0RIDR1_ID_15                  CAN0RXIDR1_ID_15
#define CAN0RIDR1_ID_18                  CAN0RXIDR1_ID_18
#define CAN0RIDR1_ID                     CAN0RXIDR1_ID
#define CAN0RIDR1_ID15_MASK              CAN0RXIDR1_ID15_MASK
#define CAN0RIDR1_ID16_MASK              CAN0RXIDR1_ID16_MASK
#define CAN0RIDR1_ID17_MASK              CAN0RXIDR1_ID17_MASK
#define CAN0RIDR1_IDE_MASK               CAN0RXIDR1_IDE_MASK
#define CAN0RIDR1_SRR_MASK               CAN0RXIDR1_SRR_MASK
#define CAN0RIDR1_ID18_MASK              CAN0RXIDR1_ID18_MASK
#define CAN0RIDR1_ID19_MASK              CAN0RXIDR1_ID19_MASK
#define CAN0RIDR1_ID20_MASK              CAN0RXIDR1_ID20_MASK
#define CAN0RIDR1_ID_15_MASK             CAN0RXIDR1_ID_15_MASK
#define CAN0RIDR1_ID_15_BITNUM           CAN0RXIDR1_ID_15_BITNUM
#define CAN0RIDR1_ID_18_MASK             CAN0RXIDR1_ID_18_MASK
#define CAN0RIDR1_ID_18_BITNUM           CAN0RXIDR1_ID_18_BITNUM
#define CAN0RIDR2                        CAN0RXIDR2
#define CAN0RIDR2_ID7                    CAN0RXIDR2_ID7
#define CAN0RIDR2_ID8                    CAN0RXIDR2_ID8
#define CAN0RIDR2_ID9                    CAN0RXIDR2_ID9
#define CAN0RIDR2_ID10                   CAN0RXIDR2_ID10
#define CAN0RIDR2_ID11                   CAN0RXIDR2_ID11
#define CAN0RIDR2_ID12                   CAN0RXIDR2_ID12
#define CAN0RIDR2_ID13                   CAN0RXIDR2_ID13
#define CAN0RIDR2_ID14                   CAN0RXIDR2_ID14
#define CAN0RIDR2_ID7_MASK               CAN0RXIDR2_ID7_MASK
#define CAN0RIDR2_ID8_MASK               CAN0RXIDR2_ID8_MASK
#define CAN0RIDR2_ID9_MASK               CAN0RXIDR2_ID9_MASK
#define CAN0RIDR2_ID10_MASK              CAN0RXIDR2_ID10_MASK
#define CAN0RIDR2_ID11_MASK              CAN0RXIDR2_ID11_MASK
#define CAN0RIDR2_ID12_MASK              CAN0RXIDR2_ID12_MASK
#define CAN0RIDR2_ID13_MASK              CAN0RXIDR2_ID13_MASK
#define CAN0RIDR2_ID14_MASK              CAN0RXIDR2_ID14_MASK
#define CAN0RIDR3                        CAN0RXIDR3
#define CAN0RIDR3_RTR                    CAN0RXIDR3_RTR
#define CAN0RIDR3_ID0                    CAN0RXIDR3_ID0
#define CAN0RIDR3_ID1                    CAN0RXIDR3_ID1
#define CAN0RIDR3_ID2                    CAN0RXIDR3_ID2
#define CAN0RIDR3_ID3                    CAN0RXIDR3_ID3
#define CAN0RIDR3_ID4                    CAN0RXIDR3_ID4
#define CAN0RIDR3_ID5                    CAN0RXIDR3_ID5
#define CAN0RIDR3_ID6                    CAN0RXIDR3_ID6
#define CAN0RIDR3_ID                     CAN0RXIDR3_ID
#define CAN0RIDR3_RTR_MASK               CAN0RXIDR3_RTR_MASK
#define CAN0RIDR3_ID0_MASK               CAN0RXIDR3_ID0_MASK
#define CAN0RIDR3_ID1_MASK               CAN0RXIDR3_ID1_MASK
#define CAN0RIDR3_ID2_MASK               CAN0RXIDR3_ID2_MASK
#define CAN0RIDR3_ID3_MASK               CAN0RXIDR3_ID3_MASK
#define CAN0RIDR3_ID4_MASK               CAN0RXIDR3_ID4_MASK
#define CAN0RIDR3_ID5_MASK               CAN0RXIDR3_ID5_MASK
#define CAN0RIDR3_ID6_MASK               CAN0RXIDR3_ID6_MASK
#define CAN0RIDR3_ID_MASK                CAN0RXIDR3_ID_MASK
#define CAN0RIDR3_ID_BITNUM              CAN0RXIDR3_ID_BITNUM
#define CAN0RDSR0                        CAN0RXDSR0
#define CAN0RDSR0_DB0                    CAN0RXDSR0_DB0
#define CAN0RDSR0_DB1                    CAN0RXDSR0_DB1
#define CAN0RDSR0_DB2                    CAN0RXDSR0_DB2
#define CAN0RDSR0_DB3                    CAN0RXDSR0_DB3
#define CAN0RDSR0_DB4                    CAN0RXDSR0_DB4
#define CAN0RDSR0_DB5                    CAN0RXDSR0_DB5
#define CAN0RDSR0_DB6                    CAN0RXDSR0_DB6
#define CAN0RDSR0_DB7                    CAN0RXDSR0_DB7
#define CAN0RDSR_ARR                     CAN0RXDSR_ARR
#define CAN0RDSR0_DB0_MASK               CAN0RXDSR0_DB0_MASK
#define CAN0RDSR0_DB1_MASK               CAN0RXDSR0_DB1_MASK
#define CAN0RDSR0_DB2_MASK               CAN0RXDSR0_DB2_MASK
#define CAN0RDSR0_DB3_MASK               CAN0RXDSR0_DB3_MASK
#define CAN0RDSR0_DB4_MASK               CAN0RXDSR0_DB4_MASK
#define CAN0RDSR0_DB5_MASK               CAN0RXDSR0_DB5_MASK
#define CAN0RDSR0_DB6_MASK               CAN0RXDSR0_DB6_MASK
#define CAN0RDSR0_DB7_MASK               CAN0RXDSR0_DB7_MASK
#define CAN0RDSR1                        CAN0RXDSR1
#define CAN0RDSR1_DB0                    CAN0RXDSR1_DB0
#define CAN0RDSR1_DB1                    CAN0RXDSR1_DB1
#define CAN0RDSR1_DB2                    CAN0RXDSR1_DB2
#define CAN0RDSR1_DB3                    CAN0RXDSR1_DB3
#define CAN0RDSR1_DB4                    CAN0RXDSR1_DB4
#define CAN0RDSR1_DB5                    CAN0RXDSR1_DB5
#define CAN0RDSR1_DB6                    CAN0RXDSR1_DB6
#define CAN0RDSR1_DB7                    CAN0RXDSR1_DB7
#define CAN0RDSR1_DB0_MASK               CAN0RXDSR1_DB0_MASK
#define CAN0RDSR1_DB1_MASK               CAN0RXDSR1_DB1_MASK
#define CAN0RDSR1_DB2_MASK               CAN0RXDSR1_DB2_MASK
#define CAN0RDSR1_DB3_MASK               CAN0RXDSR1_DB3_MASK
#define CAN0RDSR1_DB4_MASK               CAN0RXDSR1_DB4_MASK
#define CAN0RDSR1_DB5_MASK               CAN0RXDSR1_DB5_MASK
#define CAN0RDSR1_DB6_MASK               CAN0RXDSR1_DB6_MASK
#define CAN0RDSR1_DB7_MASK               CAN0RXDSR1_DB7_MASK
#define CAN0RDSR2                        CAN0RXDSR2
#define CAN0RDSR2_DB0                    CAN0RXDSR2_DB0
#define CAN0RDSR2_DB1                    CAN0RXDSR2_DB1
#define CAN0RDSR2_DB2                    CAN0RXDSR2_DB2
#define CAN0RDSR2_DB3                    CAN0RXDSR2_DB3
#define CAN0RDSR2_DB4                    CAN0RXDSR2_DB4
#define CAN0RDSR2_DB5                    CAN0RXDSR2_DB5
#define CAN0RDSR2_DB6                    CAN0RXDSR2_DB6
#define CAN0RDSR2_DB7                    CAN0RXDSR2_DB7
#define CAN0RDSR2_DB0_MASK               CAN0RXDSR2_DB0_MASK
#define CAN0RDSR2_DB1_MASK               CAN0RXDSR2_DB1_MASK
#define CAN0RDSR2_DB2_MASK               CAN0RXDSR2_DB2_MASK
#define CAN0RDSR2_DB3_MASK               CAN0RXDSR2_DB3_MASK
#define CAN0RDSR2_DB4_MASK               CAN0RXDSR2_DB4_MASK
#define CAN0RDSR2_DB5_MASK               CAN0RXDSR2_DB5_MASK
#define CAN0RDSR2_DB6_MASK               CAN0RXDSR2_DB6_MASK
#define CAN0RDSR2_DB7_MASK               CAN0RXDSR2_DB7_MASK
#define CAN0RDSR3                        CAN0RXDSR3
#define CAN0RDSR3_DB0                    CAN0RXDSR3_DB0
#define CAN0RDSR3_DB1                    CAN0RXDSR3_DB1
#define CAN0RDSR3_DB2                    CAN0RXDSR3_DB2
#define CAN0RDSR3_DB3                    CAN0RXDSR3_DB3
#define CAN0RDSR3_DB4                    CAN0RXDSR3_DB4
#define CAN0RDSR3_DB5                    CAN0RXDSR3_DB5
#define CAN0RDSR3_DB6                    CAN0RXDSR3_DB6
#define CAN0RDSR3_DB7                    CAN0RXDSR3_DB7
#define CAN0RDSR3_DB0_MASK               CAN0RXDSR3_DB0_MASK
#define CAN0RDSR3_DB1_MASK               CAN0RXDSR3_DB1_MASK
#define CAN0RDSR3_DB2_MASK               CAN0RXDSR3_DB2_MASK
#define CAN0RDSR3_DB3_MASK               CAN0RXDSR3_DB3_MASK
#define CAN0RDSR3_DB4_MASK               CAN0RXDSR3_DB4_MASK
#define CAN0RDSR3_DB5_MASK               CAN0RXDSR3_DB5_MASK
#define CAN0RDSR3_DB6_MASK               CAN0RXDSR3_DB6_MASK
#define CAN0RDSR3_DB7_MASK               CAN0RXDSR3_DB7_MASK
#define CAN0RDSR4                        CAN0RXDSR4
#define CAN0RDSR4_DB0                    CAN0RXDSR4_DB0
#define CAN0RDSR4_DB1                    CAN0RXDSR4_DB1
#define CAN0RDSR4_DB2                    CAN0RXDSR4_DB2
#define CAN0RDSR4_DB3                    CAN0RXDSR4_DB3
#define CAN0RDSR4_DB4                    CAN0RXDSR4_DB4
#define CAN0RDSR4_DB5                    CAN0RXDSR4_DB5
#define CAN0RDSR4_DB6                    CAN0RXDSR4_DB6
#define CAN0RDSR4_DB7                    CAN0RXDSR4_DB7
#define CAN0RDSR4_DB0_MASK               CAN0RXDSR4_DB0_MASK
#define CAN0RDSR4_DB1_MASK               CAN0RXDSR4_DB1_MASK
#define CAN0RDSR4_DB2_MASK               CAN0RXDSR4_DB2_MASK
#define CAN0RDSR4_DB3_MASK               CAN0RXDSR4_DB3_MASK
#define CAN0RDSR4_DB4_MASK               CAN0RXDSR4_DB4_MASK
#define CAN0RDSR4_DB5_MASK               CAN0RXDSR4_DB5_MASK
#define CAN0RDSR4_DB6_MASK               CAN0RXDSR4_DB6_MASK
#define CAN0RDSR4_DB7_MASK               CAN0RXDSR4_DB7_MASK
#define CAN0RDSR5                        CAN0RXDSR5
#define CAN0RDSR5_DB0                    CAN0RXDSR5_DB0
#define CAN0RDSR5_DB1                    CAN0RXDSR5_DB1
#define CAN0RDSR5_DB2                    CAN0RXDSR5_DB2
#define CAN0RDSR5_DB3                    CAN0RXDSR5_DB3
#define CAN0RDSR5_DB4                    CAN0RXDSR5_DB4
#define CAN0RDSR5_DB5                    CAN0RXDSR5_DB5
#define CAN0RDSR5_DB6                    CAN0RXDSR5_DB6
#define CAN0RDSR5_DB7                    CAN0RXDSR5_DB7
#define CAN0RDSR5_DB0_MASK               CAN0RXDSR5_DB0_MASK
#define CAN0RDSR5_DB1_MASK               CAN0RXDSR5_DB1_MASK
#define CAN0RDSR5_DB2_MASK               CAN0RXDSR5_DB2_MASK
#define CAN0RDSR5_DB3_MASK               CAN0RXDSR5_DB3_MASK
#define CAN0RDSR5_DB4_MASK               CAN0RXDSR5_DB4_MASK
#define CAN0RDSR5_DB5_MASK               CAN0RXDSR5_DB5_MASK
#define CAN0RDSR5_DB6_MASK               CAN0RXDSR5_DB6_MASK
#define CAN0RDSR5_DB7_MASK               CAN0RXDSR5_DB7_MASK
#define CAN0RDSR6                        CAN0RXDSR6
#define CAN0RDSR6_DB0                    CAN0RXDSR6_DB0
#define CAN0RDSR6_DB1                    CAN0RXDSR6_DB1
#define CAN0RDSR6_DB2                    CAN0RXDSR6_DB2
#define CAN0RDSR6_DB3                    CAN0RXDSR6_DB3
#define CAN0RDSR6_DB4                    CAN0RXDSR6_DB4
#define CAN0RDSR6_DB5                    CAN0RXDSR6_DB5
#define CAN0RDSR6_DB6                    CAN0RXDSR6_DB6
#define CAN0RDSR6_DB7                    CAN0RXDSR6_DB7
#define CAN0RDSR6_DB0_MASK               CAN0RXDSR6_DB0_MASK
#define CAN0RDSR6_DB1_MASK               CAN0RXDSR6_DB1_MASK
#define CAN0RDSR6_DB2_MASK               CAN0RXDSR6_DB2_MASK
#define CAN0RDSR6_DB3_MASK               CAN0RXDSR6_DB3_MASK
#define CAN0RDSR6_DB4_MASK               CAN0RXDSR6_DB4_MASK
#define CAN0RDSR6_DB5_MASK               CAN0RXDSR6_DB5_MASK
#define CAN0RDSR6_DB6_MASK               CAN0RXDSR6_DB6_MASK
#define CAN0RDSR6_DB7_MASK               CAN0RXDSR6_DB7_MASK
#define CAN0RDSR7                        CAN0RXDSR7
#define CAN0RDSR7_DB0                    CAN0RXDSR7_DB0
#define CAN0RDSR7_DB1                    CAN0RXDSR7_DB1
#define CAN0RDSR7_DB2                    CAN0RXDSR7_DB2
#define CAN0RDSR7_DB3                    CAN0RXDSR7_DB3
#define CAN0RDSR7_DB4                    CAN0RXDSR7_DB4
#define CAN0RDSR7_DB5                    CAN0RXDSR7_DB5
#define CAN0RDSR7_DB6                    CAN0RXDSR7_DB6
#define CAN0RDSR7_DB7                    CAN0RXDSR7_DB7
#define CAN0RDSR7_DB0_MASK               CAN0RXDSR7_DB0_MASK
#define CAN0RDSR7_DB1_MASK               CAN0RXDSR7_DB1_MASK
#define CAN0RDSR7_DB2_MASK               CAN0RXDSR7_DB2_MASK
#define CAN0RDSR7_DB3_MASK               CAN0RXDSR7_DB3_MASK
#define CAN0RDSR7_DB4_MASK               CAN0RXDSR7_DB4_MASK
#define CAN0RDSR7_DB5_MASK               CAN0RXDSR7_DB5_MASK
#define CAN0RDSR7_DB6_MASK               CAN0RXDSR7_DB6_MASK
#define CAN0RDSR7_DB7_MASK               CAN0RXDSR7_DB7_MASK
#define CAN0RDLR                         CAN0RXDLR
#define CAN0RDLR_DLC0                    CAN0RXDLR_DLC0
#define CAN0RDLR_DLC1                    CAN0RXDLR_DLC1
#define CAN0RDLR_DLC2                    CAN0RXDLR_DLC2
#define CAN0RDLR_DLC3                    CAN0RXDLR_DLC3
#define CAN0RDLR_DLC                     CAN0RXDLR_DLC
#define CAN0RDLR_DLC0_MASK               CAN0RXDLR_DLC0_MASK
#define CAN0RDLR_DLC1_MASK               CAN0RXDLR_DLC1_MASK
#define CAN0RDLR_DLC2_MASK               CAN0RXDLR_DLC2_MASK
