frostfire45/Codewarrior/Lib/hc12c/include/mc9s12xeq384.h
#define CAN4RIDR1_ID_18_BITNUM           CAN4RXIDR1_ID_18_BITNUM
#define CAN4RIDR2                        CAN4RXIDR2
#define CAN4RIDR2_ID7                    CAN4RXIDR2_ID7
#define CAN4RIDR2_ID8                    CAN4RXIDR2_ID8
#define CAN4RIDR2_ID9                    CAN4RXIDR2_ID9
#define CAN4RIDR2_ID10                   CAN4RXIDR2_ID10
#define CAN4RIDR2_ID11                   CAN4RXIDR2_ID11
#define CAN4RIDR2_ID12                   CAN4RXIDR2_ID12
#define CAN4RIDR2_ID13                   CAN4RXIDR2_ID13
#define CAN4RIDR2_ID14                   CAN4RXIDR2_ID14
#define CAN4RIDR2_ID7_MASK               CAN4RXIDR2_ID7_MASK
#define CAN4RIDR2_ID8_MASK               CAN4RXIDR2_ID8_MASK
#define CAN4RIDR2_ID9_MASK               CAN4RXIDR2_ID9_MASK
#define CAN4RIDR2_ID10_MASK              CAN4RXIDR2_ID10_MASK
#define CAN4RIDR2_ID11_MASK              CAN4RXIDR2_ID11_MASK
#define CAN4RIDR2_ID12_MASK              CAN4RXIDR2_ID12_MASK
#define CAN4RIDR2_ID13_MASK              CAN4RXIDR2_ID13_MASK
#define CAN4RIDR2_ID14_MASK              CAN4RXIDR2_ID14_MASK
#define CAN4RIDR3                        CAN4RXIDR3
#define CAN4RIDR3_RTR                    CAN4RXIDR3_RTR
#define CAN4RIDR3_ID0                    CAN4RXIDR3_ID0
#define CAN4RIDR3_ID1                    CAN4RXIDR3_ID1
#define CAN4RIDR3_ID2                    CAN4RXIDR3_ID2
#define CAN4RIDR3_ID3                    CAN4RXIDR3_ID3
#define CAN4RIDR3_ID4                    CAN4RXIDR3_ID4
#define CAN4RIDR3_ID5                    CAN4RXIDR3_ID5
#define CAN4RIDR3_ID6                    CAN4RXIDR3_ID6
#define CAN4RIDR3_ID                     CAN4RXIDR3_ID
#define CAN4RIDR3_RTR_MASK               CAN4RXIDR3_RTR_MASK
#define CAN4RIDR3_ID0_MASK               CAN4RXIDR3_ID0_MASK
#define CAN4RIDR3_ID1_MASK               CAN4RXIDR3_ID1_MASK
#define CAN4RIDR3_ID2_MASK               CAN4RXIDR3_ID2_MASK
#define CAN4RIDR3_ID3_MASK               CAN4RXIDR3_ID3_MASK
#define CAN4RIDR3_ID4_MASK               CAN4RXIDR3_ID4_MASK
#define CAN4RIDR3_ID5_MASK               CAN4RXIDR3_ID5_MASK
#define CAN4RIDR3_ID6_MASK               CAN4RXIDR3_ID6_MASK
#define CAN4RIDR3_ID_MASK                CAN4RXIDR3_ID_MASK
#define CAN4RIDR3_ID_BITNUM              CAN4RXIDR3_ID_BITNUM
#define CAN4RDSR0                        CAN4RXDSR0
#define CAN4RDSR0_DB0                    CAN4RXDSR0_DB0
#define CAN4RDSR0_DB1                    CAN4RXDSR0_DB1
#define CAN4RDSR0_DB2                    CAN4RXDSR0_DB2
#define CAN4RDSR0_DB3                    CAN4RXDSR0_DB3
#define CAN4RDSR0_DB4                    CAN4RXDSR0_DB4
#define CAN4RDSR0_DB5                    CAN4RXDSR0_DB5
#define CAN4RDSR0_DB6                    CAN4RXDSR0_DB6
#define CAN4RDSR0_DB7                    CAN4RXDSR0_DB7
#define CAN4RDSR_ARR                     CAN4RXDSR_ARR
#define CAN4RDSR0_DB0_MASK               CAN4RXDSR0_DB0_MASK
#define CAN4RDSR0_DB1_MASK               CAN4RXDSR0_DB1_MASK
#define CAN4RDSR0_DB2_MASK               CAN4RXDSR0_DB2_MASK
#define CAN4RDSR0_DB3_MASK               CAN4RXDSR0_DB3_MASK
#define CAN4RDSR0_DB4_MASK               CAN4RXDSR0_DB4_MASK
#define CAN4RDSR0_DB5_MASK               CAN4RXDSR0_DB5_MASK
#define CAN4RDSR0_DB6_MASK               CAN4RXDSR0_DB6_MASK
#define CAN4RDSR0_DB7_MASK               CAN4RXDSR0_DB7_MASK
#define CAN4RDSR1                        CAN4RXDSR1
#define CAN4RDSR1_DB0                    CAN4RXDSR1_DB0
#define CAN4RDSR1_DB1                    CAN4RXDSR1_DB1
#define CAN4RDSR1_DB2                    CAN4RXDSR1_DB2
#define CAN4RDSR1_DB3                    CAN4RXDSR1_DB3
#define CAN4RDSR1_DB4                    CAN4RXDSR1_DB4
#define CAN4RDSR1_DB5                    CAN4RXDSR1_DB5
#define CAN4RDSR1_DB6                    CAN4RXDSR1_DB6
#define CAN4RDSR1_DB7                    CAN4RXDSR1_DB7
#define CAN4RDSR1_DB0_MASK               CAN4RXDSR1_DB0_MASK
#define CAN4RDSR1_DB1_MASK               CAN4RXDSR1_DB1_MASK
#define CAN4RDSR1_DB2_MASK               CAN4RXDSR1_DB2_MASK
#define CAN4RDSR1_DB3_MASK               CAN4RXDSR1_DB3_MASK
#define CAN4RDSR1_DB4_MASK               CAN4RXDSR1_DB4_MASK
#define CAN4RDSR1_DB5_MASK               CAN4RXDSR1_DB5_MASK
#define CAN4RDSR1_DB6_MASK               CAN4RXDSR1_DB6_MASK
#define CAN4RDSR1_DB7_MASK               CAN4RXDSR1_DB7_MASK
#define CAN4RDSR2                        CAN4RXDSR2
#define CAN4RDSR2_DB0                    CAN4RXDSR2_DB0
#define CAN4RDSR2_DB1                    CAN4RXDSR2_DB1
#define CAN4RDSR2_DB2                    CAN4RXDSR2_DB2
#define CAN4RDSR2_DB3                    CAN4RXDSR2_DB3
#define CAN4RDSR2_DB4                    CAN4RXDSR2_DB4
#define CAN4RDSR2_DB5                    CAN4RXDSR2_DB5
#define CAN4RDSR2_DB6                    CAN4RXDSR2_DB6
#define CAN4RDSR2_DB7                    CAN4RXDSR2_DB7
#define CAN4RDSR2_DB0_MASK               CAN4RXDSR2_DB0_MASK
#define CAN4RDSR2_DB1_MASK               CAN4RXDSR2_DB1_MASK
#define CAN4RDSR2_DB2_MASK               CAN4RXDSR2_DB2_MASK
#define CAN4RDSR2_DB3_MASK               CAN4RXDSR2_DB3_MASK
#define CAN4RDSR2_DB4_MASK               CAN4RXDSR2_DB4_MASK
#define CAN4RDSR2_DB5_MASK               CAN4RXDSR2_DB5_MASK
#define CAN4RDSR2_DB6_MASK               CAN4RXDSR2_DB6_MASK
#define CAN4RDSR2_DB7_MASK               CAN4RXDSR2_DB7_MASK
#define CAN4RDSR3                        CAN4RXDSR3
#define CAN4RDSR3_DB0                    CAN4RXDSR3_DB0
#define CAN4RDSR3_DB1                    CAN4RXDSR3_DB1
#define CAN4RDSR3_DB2                    CAN4RXDSR3_DB2
#define CAN4RDSR3_DB3                    CAN4RXDSR3_DB3
#define CAN4RDSR3_DB4                    CAN4RXDSR3_DB4
#define CAN4RDSR3_DB5                    CAN4RXDSR3_DB5
#define CAN4RDSR3_DB6                    CAN4RXDSR3_DB6
#define CAN4RDSR3_DB7                    CAN4RXDSR3_DB7
#define CAN4RDSR3_DB0_MASK               CAN4RXDSR3_DB0_MASK
#define CAN4RDSR3_DB1_MASK               CAN4RXDSR3_DB1_MASK
#define CAN4RDSR3_DB2_MASK               CAN4RXDSR3_DB2_MASK
#define CAN4RDSR3_DB3_MASK               CAN4RXDSR3_DB3_MASK
#define CAN4RDSR3_DB4_MASK               CAN4RXDSR3_DB4_MASK
#define CAN4RDSR3_DB5_MASK               CAN4RXDSR3_DB5_MASK
#define CAN4RDSR3_DB6_MASK               CAN4RXDSR3_DB6_MASK
#define CAN4RDSR3_DB7_MASK               CAN4RXDSR3_DB7_MASK
#define CAN4RDSR4                        CAN4RXDSR4
#define CAN4RDSR4_DB0                    CAN4RXDSR4_DB0
#define CAN4RDSR4_DB1                    CAN4RXDSR4_DB1
#define CAN4RDSR4_DB2                    CAN4RXDSR4_DB2
#define CAN4RDSR4_DB3                    CAN4RXDSR4_DB3
#define CAN4RDSR4_DB4                    CAN4RXDSR4_DB4
#define CAN4RDSR4_DB5                    CAN4RXDSR4_DB5
#define CAN4RDSR4_DB6                    CAN4RXDSR4_DB6
#define CAN4RDSR4_DB7                    CAN4RXDSR4_DB7
#define CAN4RDSR4_DB0_MASK               CAN4RXDSR4_DB0_MASK
#define CAN4RDSR4_DB1_MASK               CAN4RXDSR4_DB1_MASK
#define CAN4RDSR4_DB2_MASK               CAN4RXDSR4_DB2_MASK
#define CAN4RDSR4_DB3_MASK               CAN4RXDSR4_DB3_MASK
#define CAN4RDSR4_DB4_MASK               CAN4RXDSR4_DB4_MASK
#define CAN4RDSR4_DB5_MASK               CAN4RXDSR4_DB5_MASK
#define CAN4RDSR4_DB6_MASK               CAN4RXDSR4_DB6_MASK
#define CAN4RDSR4_DB7_MASK               CAN4RXDSR4_DB7_MASK
#define CAN4RDSR5                        CAN4RXDSR5
#define CAN4RDSR5_DB0                    CAN4RXDSR5_DB0
#define CAN4RDSR5_DB1                    CAN4RXDSR5_DB1
#define CAN4RDSR5_DB2                    CAN4RXDSR5_DB2
#define CAN4RDSR5_DB3                    CAN4RXDSR5_DB3
#define CAN4RDSR5_DB4                    CAN4RXDSR5_DB4
#define CAN4RDSR5_DB5                    CAN4RXDSR5_DB5
#define CAN4RDSR5_DB6                    CAN4RXDSR5_DB6
#define CAN4RDSR5_DB7                    CAN4RXDSR5_DB7
#define CAN4RDSR5_DB0_MASK               CAN4RXDSR5_DB0_MASK
#define CAN4RDSR5_DB1_MASK               CAN4RXDSR5_DB1_MASK
#define CAN4RDSR5_DB2_MASK               CAN4RXDSR5_DB2_MASK
#define CAN4RDSR5_DB3_MASK               CAN4RXDSR5_DB3_MASK
#define CAN4RDSR5_DB4_MASK               CAN4RXDSR5_DB4_MASK
#define CAN4RDSR5_DB5_MASK               CAN4RXDSR5_DB5_MASK
#define CAN4RDSR5_DB6_MASK               CAN4RXDSR5_DB6_MASK
#define CAN4RDSR5_DB7_MASK               CAN4RXDSR5_DB7_MASK
#define CAN4RDSR6                        CAN4RXDSR6
#define CAN4RDSR6_DB0                    CAN4RXDSR6_DB0
#define CAN4RDSR6_DB1                    CAN4RXDSR6_DB1
#define CAN4RDSR6_DB2                    CAN4RXDSR6_DB2
#define CAN4RDSR6_DB3                    CAN4RXDSR6_DB3
#define CAN4RDSR6_DB4                    CAN4RXDSR6_DB4
#define CAN4RDSR6_DB5                    CAN4RXDSR6_DB5
#define CAN4RDSR6_DB6                    CAN4RXDSR6_DB6
#define CAN4RDSR6_DB7                    CAN4RXDSR6_DB7
#define CAN4RDSR6_DB0_MASK               CAN4RXDSR6_DB0_MASK
#define CAN4RDSR6_DB1_MASK               CAN4RXDSR6_DB1_MASK
#define CAN4RDSR6_DB2_MASK               CAN4RXDSR6_DB2_MASK
#define CAN4RDSR6_DB3_MASK               CAN4RXDSR6_DB3_MASK
#define CAN4RDSR6_DB4_MASK               CAN4RXDSR6_DB4_MASK
#define CAN4RDSR6_DB5_MASK               CAN4RXDSR6_DB5_MASK
#define CAN4RDSR6_DB6_MASK               CAN4RXDSR6_DB6_MASK
#define CAN4RDSR6_DB7_MASK               CAN4RXDSR6_DB7_MASK
#define CAN4RDSR7                        CAN4RXDSR7
#define CAN4RDSR7_DB0                    CAN4RXDSR7_DB0
#define CAN4RDSR7_DB1                    CAN4RXDSR7_DB1
#define CAN4RDSR7_DB2                    CAN4RXDSR7_DB2
#define CAN4RDSR7_DB3                    CAN4RXDSR7_DB3
#define CAN4RDSR7_DB4                    CAN4RXDSR7_DB4
#define CAN4RDSR7_DB5                    CAN4RXDSR7_DB5
#define CAN4RDSR7_DB6                    CAN4RXDSR7_DB6
#define CAN4RDSR7_DB7                    CAN4RXDSR7_DB7
#define CAN4RDSR7_DB0_MASK               CAN4RXDSR7_DB0_MASK
#define CAN4RDSR7_DB1_MASK               CAN4RXDSR7_DB1_MASK
#define CAN4RDSR7_DB2_MASK               CAN4RXDSR7_DB2_MASK
#define CAN4RDSR7_DB3_MASK               CAN4RXDSR7_DB3_MASK
#define CAN4RDSR7_DB4_MASK               CAN4RXDSR7_DB4_MASK
#define CAN4RDSR7_DB5_MASK               CAN4RXDSR7_DB5_MASK
#define CAN4RDSR7_DB6_MASK               CAN4RXDSR7_DB6_MASK
#define CAN4RDSR7_DB7_MASK               CAN4RXDSR7_DB7_MASK
#define CAN4RDLR                         CAN4RXDLR
#define CAN4RDLR_DLC0                    CAN4RXDLR_DLC0
#define CAN4RDLR_DLC1                    CAN4RXDLR_DLC1
#define CAN4RDLR_DLC2                    CAN4RXDLR_DLC2
#define CAN4RDLR_DLC3                    CAN4RXDLR_DLC3
#define CAN4RDLR_DLC                     CAN4RXDLR_DLC
#define CAN4RDLR_DLC0_MASK               CAN4RXDLR_DLC0_MASK
#define CAN4RDLR_DLC1_MASK               CAN4RXDLR_DLC1_MASK
#define CAN4RDLR_DLC2_MASK               CAN4RXDLR_DLC2_MASK
#define CAN4RDLR_DLC3_MASK               CAN4RXDLR_DLC3_MASK
#define CAN4RDLR_DLC_MASK                CAN4RXDLR_DLC_MASK
#define CAN4RDLR_DLC_BITNUM              CAN4RXDLR_DLC_BITNUM
#define CAN4RTSRH                        CAN4RXTSRH
#define CAN4RTSRH_TSR8                   CAN4RXTSRH_TSR8
#define CAN4RTSRH_TSR9                   CAN4RXTSRH_TSR9
#define CAN4RTSRH_TSR10                  CAN4RXTSRH_TSR10
#define CAN4RTSRH_TSR11                  CAN4RXTSRH_TSR11
#define CAN4RTSRH_TSR12                  CAN4RXTSRH_TSR12
#define CAN4RTSRH_TSR13                  CAN4RXTSRH_TSR13
#define CAN4RTSRH_TSR14                  CAN4RXTSRH_TSR14
#define CAN4RTSRH_TSR15                  CAN4RXTSRH_TSR15
#define CAN4RTSRH_TSR8_MASK              CAN4RXTSRH_TSR8_MASK
#define CAN4RTSRH_TSR9_MASK              CAN4RXTSRH_TSR9_MASK
#define CAN4RTSRH_TSR10_MASK             CAN4RXTSRH_TSR10_MASK
#define CAN4RTSRH_TSR11_MASK             CAN4RXTSRH_TSR11_MASK
#define CAN4RTSRH_TSR12_MASK             CAN4RXTSRH_TSR12_MASK
#define CAN4RTSRH_TSR13_MASK             CAN4RXTSRH_TSR13_MASK
#define CAN4RTSRH_TSR14_MASK             CAN4RXTSRH_TSR14_MASK
#define CAN4RTSRH_TSR15_MASK             CAN4RXTSRH_TSR15_MASK
#define CAN4RTSRL                        CAN4RXTSRL
#define CAN4RTSRL_TSR0                   CAN4RXTSRL_TSR0
#define CAN4RTSRL_TSR1                   CAN4RXTSRL_TSR1
#define CAN4RTSRL_TSR2                   CAN4RXTSRL_TSR2
#define CAN4RTSRL_TSR3                   CAN4RXTSRL_TSR3
#define CAN4RTSRL_TSR4                   CAN4RXTSRL_TSR4
#define CAN4RTSRL_TSR5                   CAN4RXTSRL_TSR5
#define CAN4RTSRL_TSR6                   CAN4RXTSRL_TSR6
#define CAN4RTSRL_TSR7                   CAN4RXTSRL_TSR7
#define CAN4RTSRL_TSR0_MASK              CAN4RXTSRL_TSR0_MASK
#define CAN4RTSRL_TSR1_MASK              CAN4RXTSRL_TSR1_MASK
#define CAN4RTSRL_TSR2_MASK              CAN4RXTSRL_TSR2_MASK
#define CAN4RTSRL_TSR3_MASK              CAN4RXTSRL_TSR3_MASK
#define CAN4RTSRL_TSR4_MASK              CAN4RXTSRL_TSR4_MASK
#define CAN4RTSRL_TSR5_MASK              CAN4RXTSRL_TSR5_MASK
#define CAN4RTSRL_TSR6_MASK              CAN4RXTSRL_TSR6_MASK
#define CAN4RTSRL_TSR7_MASK              CAN4RXTSRL_TSR7_MASK
#define CAN4RTSR                         CAN4RXTSR
#define CAN4RTSR_TSR0                    CAN4RXTSR_TSR0
#define CAN4RTSR_TSR1                    CAN4RXTSR_TSR1
#define CAN4RTSR_TSR2                    CAN4RXTSR_TSR2
#define CAN4RTSR_TSR3                    CAN4RXTSR_TSR3
#define CAN4RTSR_TSR4                    CAN4RXTSR_TSR4
#define CAN4RTSR_TSR5                    CAN4RXTSR_TSR5
#define CAN4RTSR_TSR6                    CAN4RXTSR_TSR6
#define CAN4RTSR_TSR7                    CAN4RXTSR_TSR7
#define CAN4RTSR_TSR8                    CAN4RXTSR_TSR8
#define CAN4RTSR_TSR9                    CAN4RXTSR_TSR9
#define CAN4RTSR_TSR10                   CAN4RXTSR_TSR10
#define CAN4RTSR_TSR11                   CAN4RXTSR_TSR11
#define CAN4RTSR_TSR12                   CAN4RXTSR_TSR12
#define CAN4RTSR_TSR13                   CAN4RXTSR_TSR13
#define CAN4RTSR_TSR14                   CAN4RXTSR_TSR14
#define CAN4RTSR_TSR15                   CAN4RXTSR_TSR15
#define CAN4RTSR_TSR0_MASK               CAN4RXTSR_TSR0_MASK
#define CAN4RTSR_TSR1_MASK               CAN4RXTSR_TSR1_MASK
#define CAN4RTSR_TSR2_MASK               CAN4RXTSR_TSR2_MASK
#define CAN4RTSR_TSR3_MASK               CAN4RXTSR_TSR3_MASK
#define CAN4RTSR_TSR4_MASK               CAN4RXTSR_TSR4_MASK
#define CAN4RTSR_TSR5_MASK               CAN4RXTSR_TSR5_MASK
#define CAN4RTSR_TSR6_MASK               CAN4RXTSR_TSR6_MASK
#define CAN4RTSR_TSR7_MASK               CAN4RXTSR_TSR7_MASK
#define CAN4RTSR_TSR8_MASK               CAN4RXTSR_TSR8_MASK
#define CAN4RTSR_TSR9_MASK               CAN4RXTSR_TSR9_MASK
#define CAN4RTSR_TSR10_MASK              CAN4RXTSR_TSR10_MASK
#define CAN4RTSR_TSR11_MASK              CAN4RXTSR_TSR11_MASK
#define CAN4RTSR_TSR12_MASK              CAN4RXTSR_TSR12_MASK
#define CAN4RTSR_TSR13_MASK              CAN4RXTSR_TSR13_MASK
#define CAN4RTSR_TSR14_MASK              CAN4RXTSR_TSR14_MASK
#define CAN4RTSR_TSR15_MASK              CAN4RXTSR_TSR15_MASK
#define CAN4TIDR0                        CAN4TXIDR0
#define CAN4TIDR0_ID21                   CAN4TXIDR0_ID21
#define CAN4TIDR0_ID22                   CAN4TXIDR0_ID22
#define CAN4TIDR0_ID23                   CAN4TXIDR0_ID23
#define CAN4TIDR0_ID24                   CAN4TXIDR0_ID24
#define CAN4TIDR0_ID25                   CAN4TXIDR0_ID25
#define CAN4TIDR0_ID26                   CAN4TXIDR0_ID26
#define CAN4TIDR0_ID27                   CAN4TXIDR0_ID27
#define CAN4TIDR0_ID28                   CAN4TXIDR0_ID28
#define CAN4TIDR_ARR                     CAN4TXIDR_ARR
#define CAN4TIDR0_ID21_MASK              CAN4TXIDR0_ID21_MASK
#define CAN4TIDR0_ID22_MASK              CAN4TXIDR0_ID22_MASK
#define CAN4TIDR0_ID23_MASK              CAN4TXIDR0_ID23_MASK
#define CAN4TIDR0_ID24_MASK              CAN4TXIDR0_ID24_MASK
#define CAN4TIDR0_ID25_MASK              CAN4TXIDR0_ID25_MASK
#define CAN4TIDR0_ID26_MASK              CAN4TXIDR0_ID26_MASK
#define CAN4TIDR0_ID27_MASK              CAN4TXIDR0_ID27_MASK
#define CAN4TIDR0_ID28_MASK              CAN4TXIDR0_ID28_MASK
#define CAN4TIDR1                        CAN4TXIDR1
#define CAN4TIDR1_ID15                   CAN4TXIDR1_ID15
#define CAN4TIDR1_ID16                   CAN4TXIDR1_ID16
#define CAN4TIDR1_ID17                   CAN4TXIDR1_ID17
#define CAN4TIDR1_IDE                    CAN4TXIDR1_IDE
#define CAN4TIDR1_SRR                    CAN4TXIDR1_SRR
#define CAN4TIDR1_ID18                   CAN4TXIDR1_ID18
#define CAN4TIDR1_ID19                   CAN4TXIDR1_ID19
#define CAN4TIDR1_ID20                   CAN4TXIDR1_ID20
#define CAN4TIDR1_ID_15                  CAN4TXIDR1_ID_15
#define CAN4TIDR1_ID_18                  CAN4TXIDR1_ID_18
#define CAN4TIDR1_ID                     CAN4TXIDR1_ID
#define CAN4TIDR1_ID15_MASK              CAN4TXIDR1_ID15_MASK
#define CAN4TIDR1_ID16_MASK              CAN4TXIDR1_ID16_MASK
#define CAN4TIDR1_ID17_MASK              CAN4TXIDR1_ID17_MASK
#define CAN4TIDR1_IDE_MASK               CAN4TXIDR1_IDE_MASK
#define CAN4TIDR1_SRR_MASK               CAN4TXIDR1_SRR_MASK
#define CAN4TIDR1_ID18_MASK              CAN4TXIDR1_ID18_MASK
#define CAN4TIDR1_ID19_MASK              CAN4TXIDR1_ID19_MASK
#define CAN4TIDR1_ID20_MASK              CAN4TXIDR1_ID20_MASK
#define CAN4TIDR1_ID_15_MASK             CAN4TXIDR1_ID_15_MASK
#define CAN4TIDR1_ID_15_BITNUM           CAN4TXIDR1_ID_15_BITNUM
#define CAN4TIDR1_ID_18_MASK             CAN4TXIDR1_ID_18_MASK
#define CAN4TIDR1_ID_18_BITNUM           CAN4TXIDR1_ID_18_BITNUM
#define CAN4TIDR2                        CAN4TXIDR2
#define CAN4TIDR2_ID7                    CAN4TXIDR2_ID7
#define CAN4TIDR2_ID8                    CAN4TXIDR2_ID8
#define CAN4TIDR2_ID9                    CAN4TXIDR2_ID9
#define CAN4TIDR2_ID10                   CAN4TXIDR2_ID10
#define CAN4TIDR2_ID11                   CAN4TXIDR2_ID11
#define CAN4TIDR2_ID12                   CAN4TXIDR2_ID12
#define CAN4TIDR2_ID13                   CAN4TXIDR2_ID13
#define CAN4TIDR2_ID14                   CAN4TXIDR2_ID14
#define CAN4TIDR2_ID7_MASK               CAN4TXIDR2_ID7_MASK
#define CAN4TIDR2_ID8_MASK               CAN4TXIDR2_ID8_MASK
#define CAN4TIDR2_ID9_MASK               CAN4TXIDR2_ID9_MASK
#define CAN4TIDR2_ID10_MASK              CAN4TXIDR2_ID10_MASK
#define CAN4TIDR2_ID11_MASK              CAN4TXIDR2_ID11_MASK
#define CAN4TIDR2_ID12_MASK              CAN4TXIDR2_ID12_MASK
#define CAN4TIDR2_ID13_MASK              CAN4TXIDR2_ID13_MASK
#define CAN4TIDR2_ID14_MASK              CAN4TXIDR2_ID14_MASK
#define CAN4TIDR3                        CAN4TXIDR3
#define CAN4TIDR3_RTR                    CAN4TXIDR3_RTR
#define CAN4TIDR3_ID0                    CAN4TXIDR3_ID0
#define CAN4TIDR3_ID1                    CAN4TXIDR3_ID1
#define CAN4TIDR3_ID2                    CAN4TXIDR3_ID2
#define CAN4TIDR3_ID3                    CAN4TXIDR3_ID3
#define CAN4TIDR3_ID4                    CAN4TXIDR3_ID4
#define CAN4TIDR3_ID5                    CAN4TXIDR3_ID5
#define CAN4TIDR3_ID6                    CAN4TXIDR3_ID6
#define CAN4TIDR3_ID                     CAN4TXIDR3_ID
#define CAN4TIDR3_RTR_MASK               CAN4TXIDR3_RTR_MASK
#define CAN4TIDR3_ID0_MASK               CAN4TXIDR3_ID0_MASK
#define CAN4TIDR3_ID1_MASK               CAN4TXIDR3_ID1_MASK
#define CAN4TIDR3_ID2_MASK               CAN4TXIDR3_ID2_MASK
#define CAN4TIDR3_ID3_MASK               CAN4TXIDR3_ID3_MASK
#define CAN4TIDR3_ID4_MASK               CAN4TXIDR3_ID4_MASK
#define CAN4TIDR3_ID5_MASK               CAN4TXIDR3_ID5_MASK
#define CAN4TIDR3_ID6_MASK               CAN4TXIDR3_ID6_MASK
#define CAN4TIDR3_ID_MASK                CAN4TXIDR3_ID_MASK
#define CAN4TIDR3_ID_BITNUM              CAN4TXIDR3_ID_BITNUM
#define CAN4TDSR0                        CAN4TXDSR0
#define CAN4TDSR0_DB0                    CAN4TXDSR0_DB0
#define CAN4TDSR0_DB1                    CAN4TXDSR0_DB1
#define CAN4TDSR0_DB2                    CAN4TXDSR0_DB2
#define CAN4TDSR0_DB3                    CAN4TXDSR0_DB3
#define CAN4TDSR0_DB4                    CAN4TXDSR0_DB4
#define CAN4TDSR0_DB5                    CAN4TXDSR0_DB5
#define CAN4TDSR0_DB6                    CAN4TXDSR0_DB6
#define CAN4TDSR0_DB7                    CAN4TXDSR0_DB7
#define CAN4TDSR_ARR                     CAN4TXDSR_ARR
#define CAN4TDSR0_DB0_MASK               CAN4TXDSR0_DB0_MASK
#define CAN4TDSR0_DB1_MASK               CAN4TXDSR0_DB1_MASK
#define CAN4TDSR0_DB2_MASK               CAN4TXDSR0_DB2_MASK
#define CAN4TDSR0_DB3_MASK               CAN4TXDSR0_DB3_MASK
#define CAN4TDSR0_DB4_MASK               CAN4TXDSR0_DB4_MASK
#define CAN4TDSR0_DB5_MASK               CAN4TXDSR0_DB5_MASK
#define CAN4TDSR0_DB6_MASK               CAN4TXDSR0_DB6_MASK
#define CAN4TDSR0_DB7_MASK               CAN4TXDSR0_DB7_MASK
#define CAN4TDSR1                        CAN4TXDSR1
#define CAN4TDSR1_DB0                    CAN4TXDSR1_DB0
#define CAN4TDSR1_DB1                    CAN4TXDSR1_DB1
#define CAN4TDSR1_DB2                    CAN4TXDSR1_DB2
#define CAN4TDSR1_DB3                    CAN4TXDSR1_DB3
#define CAN4TDSR1_DB4                    CAN4TXDSR1_DB4
#define CAN4TDSR1_DB5                    CAN4TXDSR1_DB5
#define CAN4TDSR1_DB6                    CAN4TXDSR1_DB6
#define CAN4TDSR1_DB7                    CAN4TXDSR1_DB7
#define CAN4TDSR1_DB0_MASK               CAN4TXDSR1_DB0_MASK
#define CAN4TDSR1_DB1_MASK               CAN4TXDSR1_DB1_MASK
#define CAN4TDSR1_DB2_MASK               CAN4TXDSR1_DB2_MASK
#define CAN4TDSR1_DB3_MASK               CAN4TXDSR1_DB3_MASK
#define CAN4TDSR1_DB4_MASK               CAN4TXDSR1_DB4_MASK
#define CAN4TDSR1_DB5_MASK               CAN4TXDSR1_DB5_MASK
#define CAN4TDSR1_DB6_MASK               CAN4TXDSR1_DB6_MASK
#define CAN4TDSR1_DB7_MASK               CAN4TXDSR1_DB7_MASK
#define CAN4TDSR2                        CAN4TXDSR2
#define CAN4TDSR2_DB0                    CAN4TXDSR2_DB0
#define CAN4TDSR2_DB1                    CAN4TXDSR2_DB1
#define CAN4TDSR2_DB2                    CAN4TXDSR2_DB2
#define CAN4TDSR2_DB3                    CAN4TXDSR2_DB3
#define CAN4TDSR2_DB4                    CAN4TXDSR2_DB4
#define CAN4TDSR2_DB5                    CAN4TXDSR2_DB5
#define CAN4TDSR2_DB6                    CAN4TXDSR2_DB6
#define CAN4TDSR2_DB7                    CAN4TXDSR2_DB7
#define CAN4TDSR2_DB0_MASK               CAN4TXDSR2_DB0_MASK
#define CAN4TDSR2_DB1_MASK               CAN4TXDSR2_DB1_MASK
#define CAN4TDSR2_DB2_MASK               CAN4TXDSR2_DB2_MASK
#define CAN4TDSR2_DB3_MASK               CAN4TXDSR2_DB3_MASK
#define CAN4TDSR2_DB4_MASK               CAN4TXDSR2_DB4_MASK
#define CAN4TDSR2_DB5_MASK               CAN4TXDSR2_DB5_MASK
#define CAN4TDSR2_DB6_MASK               CAN4TXDSR2_DB6_MASK
#define CAN4TDSR2_DB7_MASK               CAN4TXDSR2_DB7_MASK
#define CAN4TDSR3                        CAN4TXDSR3
#define CAN4TDSR3_DB0                    CAN4TXDSR3_DB0
#define CAN4TDSR3_DB1                    CAN4TXDSR3_DB1
#define CAN4TDSR3_DB2                    CAN4TXDSR3_DB2
#define CAN4TDSR3_DB3                    CAN4TXDSR3_DB3
#define CAN4TDSR3_DB4                    CAN4TXDSR3_DB4
#define CAN4TDSR3_DB5                    CAN4TXDSR3_DB5
#define CAN4TDSR3_DB6                    CAN4TXDSR3_DB6
#define CAN4TDSR3_DB7                    CAN4TXDSR3_DB7
#define CAN4TDSR3_DB0_MASK               CAN4TXDSR3_DB0_MASK
#define CAN4TDSR3_DB1_MASK               CAN4TXDSR3_DB1_MASK
#define CAN4TDSR3_DB2_MASK               CAN4TXDSR3_DB2_MASK
#define CAN4TDSR3_DB3_MASK               CAN4TXDSR3_DB3_MASK
#define CAN4TDSR3_DB4_MASK               CAN4TXDSR3_DB4_MASK
#define CAN4TDSR3_DB5_MASK               CAN4TXDSR3_DB5_MASK
#define CAN4TDSR3_DB6_MASK               CAN4TXDSR3_DB6_MASK
#define CAN4TDSR3_DB7_MASK               CAN4TXDSR3_DB7_MASK
#define CAN4TDSR4                        CAN4TXDSR4
#define CAN4TDSR4_DB0                    CAN4TXDSR4_DB0
#define CAN4TDSR4_DB1                    CAN4TXDSR4_DB1
#define CAN4TDSR4_DB2                    CAN4TXDSR4_DB2
#define CAN4TDSR4_DB3                    CAN4TXDSR4_DB3
#define CAN4TDSR4_DB4                    CAN4TXDSR4_DB4
#define CAN4TDSR4_DB5                    CAN4TXDSR4_DB5
#define CAN4TDSR4_DB6                    CAN4TXDSR4_DB6
#define CAN4TDSR4_DB7                    CAN4TXDSR4_DB7
