frostfire45/Codewarrior/Lib/hc12c/include/mc9s12xeq384.h
#define IIC1_IBAD_AD1                    IIC1_IBAD_ADR1
#define IIC1_IBAD_AD2                    IIC1_IBAD_ADR2
#define IIC1_IBAD_AD3                    IIC1_IBAD_ADR3
#define IIC1_IBAD_AD4                    IIC1_IBAD_ADR4
#define IIC1_IBAD_AD5                    IIC1_IBAD_ADR5
#define IIC1_IBAD_AD6                    IIC1_IBAD_ADR6
#define IIC1_IBAD_AD7                    IIC1_IBAD_ADR7
#define IIC1_IBAD_AD_1                   IIC1_IBAD_ADR_1
#define IIC1_IBAD_AD                     This_symb_has_been_depreciated
#define IIC1_IBAD_AD1_MASK               IIC1_IBAD_ADR1_MASK
#define IIC1_IBAD_AD2_MASK               IIC1_IBAD_ADR2_MASK
#define IIC1_IBAD_AD3_MASK               IIC1_IBAD_ADR3_MASK
#define IIC1_IBAD_AD4_MASK               IIC1_IBAD_ADR4_MASK
#define IIC1_IBAD_AD5_MASK               IIC1_IBAD_ADR5_MASK
#define IIC1_IBAD_AD6_MASK               IIC1_IBAD_ADR6_MASK
#define IIC1_IBAD_AD7_MASK               IIC1_IBAD_ADR7_MASK
#define IIC1_IBAD_AD_1_MASK              IIC1_IBAD_ADR_1_MASK
#define IIC1_IBAD_AD_1_BITNUM            IIC1_IBAD_ADR_1_BITNUM
#define IIC1_IBCR2_AD8                   IIC1_IBCR2_ADR0
#define IIC1_IBCR2_AD9                   IIC1_IBCR2_ADR1
#define IIC1_IBCR2_AD10                  IIC1_IBCR2_ADR2
#define IIC1_IBCR2_AD_8                  IIC1_IBCR2_ADR
#define IIC1_IBCR2_AD                    This_symb_has_been_depreciated
#define IIC1_IBCR2_AD8_MASK              IIC1_IBCR2_ADR0_MASK
#define IIC1_IBCR2_AD9_MASK              IIC1_IBCR2_ADR1_MASK
#define IIC1_IBCR2_AD10_MASK             IIC1_IBCR2_ADR2_MASK
#define IIC1_IBCR2_AD_8_MASK             IIC1_IBCR2_ADR_MASK
#define IIC1_IBCR2_AD_8_BITNUM           IIC1_IBCR2_ADR_BITNUM

/* 14.01.2008 */

#define Vtimmdcu                         Vectmdcu
#define Vtimpabovf                       Vectpabovf
#define VectorNumber_Vtimmdcu            VectorNumber_Vectmdcu
#define VectorNumber_Vtimpabovf          VectorNumber_Vectpabovf


/* **** 14.11.2008 11:52:21 */

#define IIC1_IBCR2_ADR0                  IIC1_IBCR2_ADR8
#define IIC1_IBCR2_ADR1                  IIC1_IBCR2_ADR9
#define IIC1_IBCR2_ADR2                  IIC1_IBCR2_ADR10
#define IIC1_IBCR2_ADR0_MASK             IIC1_IBCR2_ADR8_MASK
#define IIC1_IBCR2_ADR1_MASK             IIC1_IBCR2_ADR9_MASK
#define IIC1_IBCR2_ADR2_MASK             IIC1_IBCR2_ADR10_MASK
#define IIC1_IBCR2_ADR_MASK              IIC1_IBCR2_ADR_8_MASK
#define IIC1_IBCR2_ADR_BITNUM            IIC1_IBCR2_ADR_8_BITNUM
#define IIC0_IBCR2_ADR0                  IIC0_IBCR2_ADR8
#define IIC0_IBCR2_ADR1                  IIC0_IBCR2_ADR9
#define IIC0_IBCR2_ADR2                  IIC0_IBCR2_ADR10
#define IIC0_IBCR2_ADR0_MASK             IIC0_IBCR2_ADR8_MASK
#define IIC0_IBCR2_ADR1_MASK             IIC0_IBCR2_ADR9_MASK
#define IIC0_IBCR2_ADR2_MASK             IIC0_IBCR2_ADR10_MASK
#define IIC0_IBCR2_ADR_MASK              IIC0_IBCR2_ADR_8_MASK
#define IIC0_IBCR2_ADR_BITNUM            IIC0_IBCR2_ADR_8_BITNUM

#ifndef __V30COMPATIBLE__
#pragma OPTION DEL V30toV31Compatible
#endif
/*lint -restore  +esym(961,18.4) +esym(961,19.7) Enable MISRA rule (1.1,18.4,6.4,19.7) checking. */

#endif
